{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Vale",
  "feed_url": "https://vale.rocks/feed.json",
  "home_page_url": "https://vale.rocks",
  "items": [
    {
      "content_html": "<p>Ever since I first saw it, I knew I wanted the Framework Laptop. A modern device boasting fully replaceable components? Intriguing beyond belief. Well, I knew I was going to need a laptop for my Certificate in Design, and the Framework seemed like a no brainer, so I got it. I ordered my Framework on the 27th of November 2022, and received it a mere four days later, on December 1st. Today is a year to the day from its arrival, so I saw it fit to give a bit of a review.</p>\n<p>I bought the DIY edition, along with the SSD and RAM, directly from Framework. The specs of my specific configuration are as follows:</p>\n<ul>\n<li>CPU: 12th Gen Intel® Core™ i5-1240P (16) @ 4.40 GHz</li>\n<li>GPU: Intel Iris Xe Graphics</li>\n<li>Memory: 2x 8GB DDR4-3200 RAM</li>\n<li>Storage: 1TB WD BLACK SN770 NVMe SSD</li>\n</ul>\n<h2 id=\"assembly-and-setup\">Assembly and Setup</h2>\n<p>My laptop came very well packed, and upon unboxing, I got straight to building it. As I opted for the DIY edition, I had to remove the input cover, place in the SSD and RAM, and then reassemble the device. Then all I needed to do was slide in my expansion cards, and I was good to go. This was a very simple process, and the guide regarding it was comprehensive. The newer models are even easier, as the input cover comes detached.</p>\n<p>Following up on the hardware setup was the software setup. Installing Arch, my Linux distro of choice, proved nearly as seamless as ever. I did have to implement a small fix to get the brightness keys to function, but it was straightforward to implement and well documented. This was particularly fantabulous, as Arch isn&#8217;t among their officially supported Linux distros. In fact, it&#8217;s refreshing to see a list of officially supported distros at all.</p>\n<h2 id=\"cost--value\">Cost & Value</h2>\n<p>The cost associated with the Framework is undeniably high. There is no way around that. In comparison to other laptops with similar specifications, it is marginally more expensive. However, the initial cost shouldn&#8217;t be the only consideration. Purchasing the Framework Laptop means investing in repairability. While it might seem more expensive upfront, the long-term value lies in the ability to replace components over time. This aspect ultimately justifies the initial expense, making it a more cost effective choice in the long run. It&#8217;s also worth noting that you&#8217;re supporting a smaller company that, in my opinion, seems dedicated to doing the right thing.</p>\n<p>With that said, you can save some money when buying your laptop by acquiring your RAM and SDD from alternative sources. Prices are inflated when purchasing directly from Framework, and better prices can be found when purchasing online. You can quite easily shave $100 AUD off the price by purchasing the components online.</p>\n<figure class=\"right\">\n<img src=\"https://images.prismic.io/frameworkmarketplace/25c9a15f-4374-4144-863e-1c649ea24dd8_iris-azalea-sidebyside-01.jpg?auto=compress,format\" alt=\"A picture of two Framework Laptop 13 computers back to back on a dark background.\" />\n</figure>\n\n<h2 id=\"build-quality\">Build Quality</h2>\n<p>The build quality of the Framework is alright. While it doesn&#8217;t exude the sturdiness of some other laptops I&#8217;ve encountered, it&#8217;s far from flimsy. There is minor flex in the chassis if picking the laptop up from a corner, but it is so minimal that it&#8217;s hardly of relevance. Of more notable concern are the screen and hinge.</p>\n<p>The screen itself is excellent. It&#8217;s 3:2 aspect ratio is ideal for tasks such as coding and document processing but affects the structural design, leading to flex, which causes screen wobbling at the slightest nudge. This makes typing on a lap or in a car rather challenging. The hinge is also a hindrance, as it struggles to hold the screen at more aggressive angles. They have released newer, stronger hinges as an optional addition to combat this.</p>\n<h2 id=\"modularity--customisation\">Modularity & Customisation</h2>\n<p>The reason that just about anyone would buy a Framework is for its user accessible servicing and customisation options. While I haven&#8217;t yet broken my laptop, it&#8217;s quite the comfort to know that at any point I can simply replace a broken part with nothing but the included screwdriver.</p>\n<p>Speaking of the included screwdriver, it&#8217;s much better than it has any right to be. Its magnetically attached tip can be removed to allow choice between both Torx and Phillips heads, and the reverse side has a handy pry tool. Its body has a great build and flat edges to prevent it rolling away. I frequently find myself applying its utility beyond laptop matters.</p>\n<p>Returning to the laptop, the flexibility to swap out components whenever I choose or opt for an upgrade adds a layer of convenience. The prospect of seamlessly installing new parts as they release is a significant advantage, as is choosing exactly the ports and components I want.</p>\n<h2 id=\"battery-life\">Battery Life</h2>\n<p>There is a negative sentiment online regarding the battery on the Framework. I&#8217;ve seen countless people claim that they only yield 5 hours of battery life from a charge. While that may have been true at a point, things have since improved. There was an issue with select expansion cards that caused increased power use, but, fortunately, Framework fixed it in subsequent productions and released a fix for those capable of performing it. Yes, these are issues, but Framework has gone above and beyond in not only addressing, but also actively rectifying them to the best of their ability.</p>\n<p>They&#8217;ve released a new 61Wh battery and battery optimisation improvements in their newer generations, especially in the AMD chipsets. Even without these improvements, I&#8217;ve been able to surpass over 10 hours out of the 55Wh battery in my laptop with some battery optimisations.</p>\n<h2 id=\"support\">Support</h2>\n<p>Speaking of their commitment to addressing issues, their user support is excellent. In the few instances where I&#8217;ve contacted support, I&#8217;ve generally gotten very helpful and timely responses. Admirably, they seem to prioritise the mental health of their support employees. Their <a href=\"https://old.reddit.com/r/framework/comments/178jutx/moment_of_appreciation_for_framework_taking_care\">stance against abuse</a> and <a href=\"https://community.frame.work/t/status-of-framework-support-november-6th-2023\">aversion to seasonal hiring</a> demonstrates a conscientious approach I really can&#8217;t say I&#8217;ve seen elsewhere.</p>\n<p>As for their software support, that can be a bit more hit and miss. My 12th Gen Framework has been waiting on a BIOS update with numerous improvements, such as compatibility with the new 61Wh battery. <a href=\"https://community.frame.work/t/12th-gen-intel-core-bios-3-06-beta\">There has been work done</a>, but it&#8217;s been in beta for several months and sets a bad precedent.</p>\n<h2 id=\"community\">Community</h2>\n<p>It isn&#8217;t just Framework themselves that support their products, but also the surrounding community. The community cultivated around the Framework Laptop is truly exceptional, the likes I haven&#8217;t seen with any other product. The company hosts an open and highly constructive forum where users share all sorts of things. Every second day, someone shares some crazy thing, like <a href=\"https://community.frame.work/t/spring-loaded-expansion-card/36013\">spring loaded expansion cards</a> or a <a href=\"https://community.frame.work/t/framework-gaming-handheld-video/36591\">crazy new form factor</a>. It&#8217;s excellent to see. I&#8217;ve found that any issue I&#8217;ve encountered, no matter how obscure (and trust me, I stumble upon some pretty obscure ones), has had some solution or ongoing discussion within the forums.</p>\n<h2 id=\"overall-evaluation\">Overall Evaluation</h2>\n<p>I think the Framework Laptop is excellent for just about anyone needing a computer, but especially the technologically inclined. This machine is excellent, especially as a tech enthusiast. The modularity and adaptability makes tinkering an absolute joy. Especially when backed by an exceptional community that&#8217;s always ready to dive into the depths of innovation.</p>\n<p>If you need any further evidence as to how highly I regard the Framework Laptop 13, then the fact that I convinced my brother to select one as a replacement for his ageing Surface Go should tell you all you need to know. As he got it more recently, he had the option of the new AMD model, which meant waiting a while due to the batch system, but it only took just over a week to arrive once it shipped. He&#8217;s been very happy with it, and it&#8217;s worked excellently thus far.</p>\n<h2 id=\"2024-update\">2024 Update</h2>\n<p>I&#8217;m still loving my Framework, but a bit has changed since I wrote this article. Firstly, Framework finally <a href=\"https://community.frame.work/t/12th-gen-intel-core-bios-3-08-beta-release/43244\">released a new beta BIOS</a>. This beta process then proceeded to once again stall for a significant period, and several people <a href=\"https://community.frame.work/t/my-framework-has-been-abandoned\">(including myself)</a> called out the lack of transparency and critical security patches. They&#8217;ve taken action to improve, but it does leave a sour taste in my mouth.</p>\n<p>In terms of my specific computer, I&#8217;ve made some changes. At the end of 2023, I moved from Arch Linux to NixOS. It&#8217;s got an awesome declarative configuration model that allows the entire OS to be regenerated whenever needed. I truly am loving it.</p>\n<p>I also chose to leverage the modularity of my Framework by switching out my keyboard. As I use Colemak DH, there wasn&#8217;t much point in having a QWERTY keyboard, so I moved to a <a href=\"https://frame.work/au/en/products/keyboard-blank\">blank keyboard</a>. The process wasn&#8217;t too difficult thanks to the comprehensive documentation hosted on Framework&#8217;s <a href=\"https://knowledgebase.frame.work\">Knowledge Base</a>, but it was time consuming. There were <em>so many screws</em>. I&#8217;m happy with the end result though, and really love the sleek, minimalist style it provides.</p>\n<hr>\n<p>I hope you enjoyed this review. If you&#8217;ve got any questions about the laptop, then I&#8217;m happy to answer them in the comments, and if you want to support me in writing more like this in the future, then consider <a href=\"/support\">supporting me</a>.</p>\n",
      "date_published": "2023-12-01",
      "id": "https://vale.rocks/posts/a-year-with-the-framework-laptop-13.html",
      "title": "A Year With The Framework Laptop 13",
      "url": "https://vale.rocks/posts/a-year-with-the-framework-laptop-13.html"
    },
    {
      "content_html": "<p>When I first entered the bloody fray that is the web development sphere, I did plenty of very dumb stuff thanks to not knowing any better. Before I figured out what a static site generator was or the concept of PHP&#8217;s <code>include</code>, I copied a lot of code between sites. Namely, navs and footers.</p>\n<p>Each and every page of my site would have a duplicate copy of my navbar and footer copied into it, meaning that whenever I wanted to do something like add a new item, I had to jump across pages and update each instance individually.</p>\n<p>In my endless genius, I decided the solution to my woes was to use <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/iframe\">iframes</a>. My initial implementations circa 2018 were rather poor, as you might imagine from an inexperienced, 12 year old, me.</p>\n<p>They were incredibly clunky and relied on JavaScript to show and hide them. They also didn&#8217;t really mesh with the page and were constantly overflowing, causing a lack of cohesion and inconvenient scrollbars.</p>\n<p>Both my knowledge and the web have come a long way since those days, and my recent reading up about <a href=\"https://martinfowler.com/articles/micro-frontends.html\">micro-frontends</a> led me to give iframes another spin.</p>\n<h2 id=\"uses\">Uses</h2>\n<p>Front-end development isn&#8217;t the simple craft it was years ago, and it&#8217;s reached a point where the micro-service architecture that&#8217;s grown in popularity for backends has become worth considering for frontends. There are plenty of ways to implement them, but iframes are perhaps the easiest.</p>\n<p>Each independent part of an application can be split up and reconstituted by embedding them in their own iframes.</p>\n<h2 id=\"implementing\">Implementing</h2>\n<p>Getting started is simple. All you need to do is place <code>&lt;iframe src=&quot;https://example.com&quot;&gt;&lt;/iframe&gt;</code> on a page, substituting <code>example.com</code> for the URL of your required resource.</p>\n<p>That&#8217;s a start, but it&#8217;s limited. The iframe won&#8217;t scale to the size of its content; it looks ugly, and the parent can&#8217;t communicate with it. Thankfully, we can sort this out.</p>\n<h3 id=\"styling\">Styling</h3>\n<p>First, let&#8217;s remove the border put around them by the default user-agent styling on most browsers. Gecko, Blink, and WebKit default to this styling:</p>\n<pre><code class=\"hljs language-css\"><span class=\"hljs-selector-tag\">iframe</span> {\n\t<span class=\"hljs-attribute\">border</span>: <span class=\"hljs-number\">2px</span> inset;\n}\n</code></pre><p>Given our needs, I think it sane to remove that border for better visual cohesion with the rest of the page, like so:</p>\n<pre><code class=\"hljs language-css\"><span class=\"hljs-selector-tag\">iframe</span> {\n\t<span class=\"hljs-attribute\">border</span>: none;\n}\n</code></pre><h3 id=\"sizing\">Sizing</h3>\n<p>Now we need to sort out some sizing. There are a few ways to go about this. We can use some CSS to set the frame to a fixed size, or we can write some simple JavaScript that handles sizing it for us. Either way you do it, it&#8217;s worth noting that all iframes have a width of 300 and height of 150.</p>\n<p>If we want to do it with CSS, then we can just apply a <code>width</code> and <code>height</code> like we would to any other element, but we run into an issue fairly quickly. There is no easy way to get the dimensions of a page in an iframe via CSS alone. This makes it a write-off unless we know the exact dimensions of the page or are happy with it being clipped and presented with a scrollbar.</p>\n<p>Thankfully, we can use a bit of the ol&#8217; JavaScript.</p>\n<p>The simplest way is to grab the size of the iframe&#8217;s contents when it loads, although that won&#8217;t dynamically handle changes in the size of the iframe&#8217;s contents.</p>\n<pre><code class=\"hljs language-html\"><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">iframe</span> <span class=\"hljs-attr\">src</span>=<span class=\"hljs-string\">&quot;https://example.com&quot;</span> <span class=\"hljs-attr\">onload</span>=<span class=\"hljs-string\">&quot;this.style.height=(this.contentWindow.document.body.scrollHeight)+&#x27;px&#x27;;&quot;</span> <span class=\"hljs-attr\">width</span>=<span class=\"hljs-string\">&quot;100%&quot;</span>&gt;</span> <span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">iframe</span>&gt;</span>\n</code></pre><p>We can improve this by setting up a script to run in our iframe that tells our parent page when its size changes. Definitely host the pages you&#8217;re embedding and your parent pages on the same domain to avoid Cross-Origin Resource Sharing (CORS) errors.</p>\n<p>First, we&#8217;ll need to give our iframe an id so we can reference it. We can also remove the onload JavaScript, as we&#8217;ll be separating that out.</p>\n<pre><code class=\"hljs language-html\"><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">iframe</span> <span class=\"hljs-attr\">id</span>=<span class=\"hljs-string\">&quot;exampleIframe&quot;</span> <span class=\"hljs-attr\">src</span>=<span class=\"hljs-string\">&quot;https://example.com&quot;</span>&gt;</span><span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">iframe</span>&gt;</span>\n</code></pre><p>On the page we&#8217;re embedding, we can add this script, which will send a message to the parent window stating its height and width.</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-variable language_\">window</span>.<span class=\"hljs-property\">parent</span>.<span class=\"hljs-title function_\">postMessage</span>(\n\t{\n\t\t<span class=\"hljs-attr\">type</span>: <span class=\"hljs-string\">&quot;resize&quot;</span>,\n\t\t<span class=\"hljs-attr\">height</span>: <span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-property\">body</span>.<span class=\"hljs-property\">scrollHeight</span>,\n\t\t<span class=\"hljs-attr\">width</span>: <span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-property\">body</span>.<span class=\"hljs-property\">scrollWidth</span>,\n\t},\n\t<span class=\"hljs-string\">&quot;https://example.com&quot;</span>,\n);\n</code></pre><p>Back on our parent, we can give it a script that listens for a message of the type &#8216;resize&#8217;, at which point it can update the dimensions of the iframe with the values sent in the message.</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-variable language_\">window</span>.<span class=\"hljs-title function_\">addEventListener</span>(<span class=\"hljs-string\">&quot;message&quot;</span>, <span class=\"hljs-keyword\">function</span> (<span class=\"hljs-params\">e</span>) {\n\t<span class=\"hljs-keyword\">if</span> (e.<span class=\"hljs-property\">data</span>.<span class=\"hljs-property\">type</span> === <span class=\"hljs-string\">&quot;resize&quot;</span>) {\n\t\t<span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-title function_\">getElementById</span>(<span class=\"hljs-string\">&quot;exampleIframe&quot;</span>).<span class=\"hljs-property\">style</span>.<span class=\"hljs-property\">height</span> = e.<span class=\"hljs-property\">data</span>.<span class=\"hljs-property\">height</span> + <span class=\"hljs-string\">&quot;px&quot;</span>;\n\t\t<span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-title function_\">getElementById</span>(<span class=\"hljs-string\">&quot;exampleIframe&quot;</span>).<span class=\"hljs-property\">style</span>.<span class=\"hljs-property\">width</span> = e.<span class=\"hljs-property\">data</span>.<span class=\"hljs-property\">width</span> + <span class=\"hljs-string\">&quot;px&quot;</span>;\n\t}\n});\n</code></pre><p>And voila, we should now have dynamically sized iframes regardless of the child&#8217;s content.</p>\n<p>Alternatively, you can use an existing library like <a href=\"https://iframe-resizer.com\">iframe-resizer</a> to do it without the hassle of rolling it yourself. Do consider first if you <em>need</em> another dependency in your project, though.</p>\n<h3 id=\"communicating-with-our-iframe\">Communicating With Our iFrame</h3>\n<p>This is the least fun bit of iframes, trying to communicate with them. It&#8217;s doable, just a bit finicky &#8211; mainly because of our old friend CORS &#8211; but it shouldn&#8217;t be too much of a hassle assuming they&#8217;re on the same domain.</p>\n<p>We&#8217;ll use JavaScript&#8217;s <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/postMessage\"><code>post-message</code></a> API to facilitate sharing information. In fact, we&#8217;ve already used this for sending the page dimensions from our iframe to the parent. The postMessage API allows you to send objects, arrays, etc, but for the scope of this article we&#8217;ll stick to simple stings.</p>\n<h4 id=\"from-iframe-to-parent\">From iFrame to Parent</h4>\n<p>To send a message from the embedded iframe to the parent document, use this code in the iframe&#8217;s document:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-variable language_\">window</span>.<span class=\"hljs-property\">parent</span>.<span class=\"hljs-title function_\">postMessage</span>(<span class=\"hljs-string\">&quot;Hello from iframe!&quot;</span>, <span class=\"hljs-string\">&quot;https://example.com&quot;</span>);\n</code></pre><p>To receive and handle messages in the parent document, add this code to the parent document:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-variable language_\">window</span>.<span class=\"hljs-title function_\">addEventListener</span>(<span class=\"hljs-string\">&quot;message&quot;</span>, <span class=\"hljs-keyword\">function</span> (<span class=\"hljs-params\">event</span>) {\n\t<span class=\"hljs-keyword\">if</span> (event.<span class=\"hljs-property\">origin</span> !== <span class=\"hljs-string\">&quot;https://example.com&quot;</span>) <span class=\"hljs-keyword\">return</span>;\n\t<span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-title function_\">log</span>(<span class=\"hljs-string\">&quot;Message from iframe:&quot;</span>, event.<span class=\"hljs-property\">data</span>);\n});\n</code></pre><p>If you open your browser console, you should see the messages coming through.</p>\n<h2 id=\"why\">Why?</h2>\n<p>So, all that is a lot of work, which may make you ask, &#8216;why bother?&#8217;. Why not implement micro-frontends another way, such as by using web components, route segmentation, or the like? Well, iframes have one big benefit that is possibly also their biggest weakness. <strong>Every iframe is isolated.</strong> This is good in the sense that iframes won&#8217;t clash. You&#8217;ll have no CSS conflicts, no JavaScript variable collisions, and no worries about one component affecting another unintentionally. This is great for:</p>\n<ul>\n<li>Sandboxing third-party content: You can safely embed external widgets or tools without worrying about them interfering with your main page.</li>\n<li>Legacy system integration: When modernising an application piece by piece, iframes can help you gradually replace old components with new ones without a complete overhaul.</li>\n<li>Fault isolation: One iframe failing doesn&#8217;t kill the entire site or app.</li>\n</ul>\n<p>But not so great for:</p>\n<ul>\n<li>SEO: Search engines may have difficulty indexing content within iframes, which could impact search rankings.</li>\n<li>User experience: Navigation can become tricky, as each iframe essentially has its own browsing context.</li>\n<li>Accessibility: Screen readers and other assistive technologies may have difficulty navigating between iframes.</li>\n<li>Performance overhead: While iframes can help with perceived performance, they do introduce some overhead, as each iframe requires its own resources and DOM.</li>\n</ul>\n",
      "date_published": "2024-10-08",
      "id": "https://vale.rocks/posts/building-sites-with-iframes.html",
      "title": "Building Sites With iFrames",
      "url": "https://vale.rocks/posts/building-sites-with-iframes.html"
    },
    {
      "content_html": "<p>Every now and then, somebody decides that it is time to mess around and &#8216;improve&#8217; enterprise Wi-Fi. As of late, someone has been tweaking and mucking about with the internet configuration of Australian public schools.</p>\n<p>This brief tutorial aims to outline how to properly connect to Australian public-school Wi-Fi at the current time.</p>\n<h2 id=\"step-1\">Step 1</h2>\n<p>The first step in getting onto the network is to find out if your password has expired. In most cases, your Department of Education login (the same one you use to access Connect) will expire every 90 days (about 3 months).</p>\n<p>If you expect that your password has expired, you will have to reset it.</p>\n<p>If you have an internet connection, then the easiest way to reset it is through the <a href=\"https://apps.det.wa.edu.au/dam/portal/changePassPage.do\">DoE Portal</a>.</p>\n<p>You could also go to <a href=\"https://connect.det.wa.edu.au\">Connect</a> and login. Once logged in, you can navigate to &#8216;My Connect&#8217; and change your password to something new and secure.</p>\n<p>In the event that you don&#8217;t have an internet connection, you can request that your teacher or network admin change your password.</p>\n<h2 id=\"step-2\">Step 2</h2>\n<p>Your next step is to install the required certificates. These certificates allow you to certify yourself on the network. The process varies based on your computer&#8217;s operating system.</p>\n<blockquote>\n<p>[!IMPORTANT]\nNote that installing these certificates allows your school to view encrypted network packets sent to or from your device. That means that your school can see your passwords, what sites you visit, and, in some cases, your search history.</p>\n</blockquote>\n<h3 id=\"windows\">Windows</h3>\n<p>As the Australian government loves further padding the pockets of Microsoft, most schools supply guides for getting setup with Windows. That said, many of these guides are crap, so the process is documented here.</p>\n<ol>\n<li>Start off by getting connected to the school network. The certificates are only available on the internal network and not on non-school networks.</li>\n<li>Once connected, you must download these certificates:</li>\n</ol>\n<ul>\n<li><a href=\"https://certs.education.wa.edu.au/education-pki/cert/Education-CA.cer\">Education-CA.cer</a></li>\n<li><a href=\"https://certs.education.wa.edu.au/education-pki/cert/Education-SubCA1.cer\">Education-SubCA1.cer</a></li>\n<li><a href=\"https://certs.education.wa.edu.au/education-pki/cert/Education-SubCA2.cer\">Education-SubCA2.cer</a></li>\n</ul>\n<ol start=\"3\">\n<li>On your keyboard, hit the &#8216;Windows&#8217; key and R key simultaneously. In the box that appears, type <code>mmc.exe</code>.</li>\n<li>In the application that opens, press the Ctrl key and the M key simultaneously.</li>\n<li>In the left panel, double click &#8216;Certificates&#8217;. In the pop-up that opens, select &#8216;Computer account&#8217; and then click next.</li>\n<li>Select &#8216;Local computer&#8217; and then click Finish. You should be directed back to the main page of the application.</li>\n<li>In the left panel, you should click the small arrow next to &#8216;Certificates (Local Computer)&#8217; to expand the category. Then click the small arrow next to &#8216;Trusted Root Certification Authorities&#8217;.</li>\n<li>You should now see the Certificates folder on the left panel. Right click the folder to bring up the context menu. In the menu, select All Tasks and then Import.</li>\n<li>In the wizard that should have appeared, select &#8216;Local Machine&#8217; and then &#8216;Next&#8217;.</li>\n<li>On the next page, click &#8216;Browse&#8230;&#8217; and locate your certificates. Select one of them, click open, and then click &#8216;Next&#8217;.</li>\n<li>In the next pop-up, select &#8216;Trusted Root Certification Authorities&#8217; and then click &#8216;OK&#8217;.</li>\n<li>You should now be presented with a page showing the settings you&#8217;ve chosen in this guide. The &#8216;Certificate Store Selected by User&#8217; should be &#8216;Trusted Root Certification Authorities&#8217; and the &#8216;Content&#8217; should be &#8216;Certificate&#8217;.</li>\n</ol>\n<h3 id=\"linux\">Linux</h3>\n<p>Most institutions don&#8217;t offer support for Linux. There&#8217;s a certain misunderstanding that anyone using Linux is an elite hacker with intention to take down the mainframe and overthrow the establishment. It&#8217;s a pain, and I&#8217;ve spent countless hours over the years getting it working.</p>\n<p>Thankfully, we&#8217;ve now got a handy script developed by <a href=\"https://toastxc.xyz\">ToastXC</a> and myself. It connects to the network, downloads the certs, and applies a patch if running Fedora. It&#8217;s available on GitHub as <a href=\"https://github.com/toastxc/DoE-Network-Kit-Linux\">DoE-Network-Kit-Linux</a>.</p>\n<ol>\n<li>Ensure you have all the required dependencies installed. These include OpenSSL, Curl, Git, and NetworkManager. They should all be available in your distro&#8217;s package repository.</li>\n<li>Download the script. You can do this by cloning the GitHub repo with <code>git clone https://github.com/toastxc/DoE-Network-Kit-Linux.git</code>.</li>\n<li>Then you can enter the directory holding the script with <code>cd DoE-Network-Kit-Linux</code>.</li>\n<li>This directory holds scripts for different schools. Unless your school is specifically listed, <code>generic.sh</code> should work for you. Run the script with <code>sh generic.sh</code>. You will probably need root permissions, so consider prefixing the command with something like <code>sudo</code> or <code>doas</code>.</li>\n<li>The script will now run and guide you through the rest of the process. Do note that your password won&#8217;t show up while you write it for security reasons.</li>\n</ol>\n<h2 id=\"step-3\">Step 3</h2>\n<p>You can now log onto your school&#8217;s internet. In the event that your browser doesn&#8217;t redirect you automatically, you may need to <a href=\"http://sig.site.internal:1000/login?\">manually access the login portal</a>.</p>\n<hr>\n<p>Had any issues with the process or think something may have changed? Leave a comment down below, and I&#8217;ll try my best to assist.</p>\n",
      "date_published": "2022-10-12",
      "id": "https://vale.rocks/posts/connecting-to-australian-public-school-internet.html",
      "title": "Connecting to Australian Public School Internet",
      "url": "https://vale.rocks/posts/connecting-to-australian-public-school-internet.html"
    },
    {
      "content_html": "<p>Fear of hacking often conjures up images of a solitary figure cloaked in darkness, sporting a hoodie, and surrounded by monitors cascading Matrix style green code. Bonus points if the &#8216;hacker&#8217; is wearing a Guy Fawkes mask. However, this depiction couldn&#8217;t be further from the truth. Most of the hackers I know either wear thigh high pink socks or are balding and middle aged.</p>\n<p>Such misconceptions about hackers and cybersecurity in general have persisted for years, fuelled by sensationalism and misinformation. As someone frequently tasked with debunking cybersecurity fallacies, I&#8217;ve decided enough is enough. This article seeks to debunk common myths surrounding cybersecurity and, with any luck, also frees me from the perpetual cycle of explanation.</p>\n<blockquote>\n<p>[!NOTE]\nThis article is written with the average computer user in mind. In its suggestions, it targets both security and convenience. If you boast more technical expertise, then you can and should tweak this information to your needs.</p>\n</blockquote>\n<h2 id=\"passwords\">Passwords</h2>\n<p>Almost everyone uses passwords. They&#8217;re the simplest solution for restricting access to something, and they do their job well. Unfortunately, years of bad advice has left people creating passwords that are confusing and insecure. I want to clear this up and identify some best practices.</p>\n<p>Something to understand is that we generally calculate the strength of passwords using something called entropy. Entropy refers to how unpredictable something is - in this case, a password. We measure entropy in bits. The more bits of entropy a password has, the more guesses are needed to get it right.</p>\n<p>A short password is easy to guess, but as you might imagine, it becomes harder to guess the longer it becomes. The act of guessing passwords through this guess work is called bruteforcing.</p>\n<p>Bruteforcing is when someone tries <em>lots</em> of different passwords in rapid succession to find the one that works. A bit like when you get locked out of your phone and try lots of different variations in an attempt to rediscover your password.</p>\n<p>Most people know not to use names or common phrases in their passwords. Through years of conditioning, we&#8217;ve taught people that they should construct confusing passwords, substituting letters for numbers and forcing in random characters as they please. The embedded xkcd comic outlines the issue.</p>\n<figure class=\"right\">\n<img src=\"https://imgs.xkcd.com/comics/password_strength.png\" alt=\"xkcd comic strip comparing password strength and memorability, showing a complicated password and a simple passphrase, highlighting the entropy and guessability of each, and a stick figure finding the passphrase easier to remember.\" />\n<figcaption>Relevant xkcd comic. Credit: <a href=\"https://xkcd.com/936\">xkcd</a></figcaption>\n</figure>\n\n<p>These confusing, special character infused passwords don&#8217;t improve security; they harm it. They are hard for humans and easy for computers - the worst of both worlds. I previously mentioned entropy and how we can use it to calculate the strength of a password. Well, it isn&#8217;t a perfect measure.</p>\n<p>While bruteforcing may have started by simply crawling through a list of predefined common passwords, they later moved on to using complex algorithms. zxcvbn is a very useful tool that takes these algorithms into account to give an accurate idea of what more modern bruteforcing attacks are capable of.</p>\n<p>Bitwarder is a free and open source password manager and <a href=\"https://bitwarden.com/password-strength\">supplies a free tool to check the strength of a password against zxcvbn</a>. It&#8217;s worth giving it a go with a range of different passwords, just to see what is actually strong.</p>\n<p>You should quickly come to realise that, for the average person, passphrases are much more effective than passwords. Easy to remember and, when done right, hard for a computer to crack.</p>\n<p>Many people get this far and then make a fatal mistake. They reuse their passwords across multiple sites or store them insecurely. In the modern age, you should be using a password manager. Something like <a href=\"https://bitwarden.com\">Bitwarden</a> or <a href=\"https://proton.me/pass\">Proton Pass</a> allows you to generate secure passwords, store them, and auto fill them on the login page. It&#8217;s easy to use and provides much needed security. If you take one thing out of this article, make it this.</p>\n<h3 id=\"periodic-password-changes\">Periodic Password Changes</h3>\n<p>While I&#8217;m on the topic of passwords, I need to do a brief rant on mandatory password updates. Many organisations require that users periodically change their passwords. This is a terrible idea. <a href=\"https://learn.microsoft.com/en-gb/archive/blogs/secguide/security-baseline-final-for-windows-10-v1903-and-windows-server-v1903\">Even Microsoft is against it</a>.</p>\n<p>It prevents users from memorising their passwords, and prompts them to create simpler, easier to remember passwords. It also results in security fatigue, where users become indifferent or careless about security measures in general, which undermines security measures.</p>\n<p>Moreover, it also introduces unnecessary risk when users are forced to change their passwords, potentially leading to weaker passwords being chosen and opens up opportunities for phishing attacks.</p>\n<p>There really is no point in implementing these forced changes, especially in the modern age. It does far more harm than good.</p>\n<h2 id=\"multifactor-authentication\">Multifactor Authentication</h2>\n<p>Some people think that a secure password is enough and that it&#8217;ll ensure their security, but passwords should only ever be used alongside another form of authentication. We call this Multifactor Authentication (MFA). Passwords aren&#8217;t perfect, and shouldn&#8217;t be the only point of access. It&#8217;s a single point of failure that can do undue and preventable damage.</p>\n<p>Timed One Time Passwords (TOTP) are excellent and are one of the best options. The user receives a unique and temporary code that they can use. It&#8217;s easy for the user and extremely secure.</p>\n<p>Unfortunately, one of the most common MFA solutions is SMS based authentication. It&#8217;s hugely insecure, and most advisories urge against its usage. Exploitation of the system is all too common, and I have an upcoming article discussing the inherent issues with SMS as a whole.</p>\n<p>Another good option is hardware authentication, such as a <a href=\"https://www.yubico.com\">Yubikey</a>. This works as you might expect a car or house key to function. You plug it into your computer, and it authenticates you. Unfortunately, this also introduces issues of its own. One of these issues is the potential for loss or theft of the physical device. The effect is more or less the same as what would happen should keys of any other nature be lost or stolen.</p>\n<h2 id=\"social-engineering\">Social Engineering</h2>\n<p>The fact that focus is often on concepts such as making secure passwords, encryption, and obscurity is detrimental to awareness of the real threat. Social engineering. It is far easier for a malicious actor to put together a simple attack that exploits human nature than it is to sink time into finding software vulnerabilities to exploit.</p>\n<p>I think the best example I can give is this scene from the 1995 film Hackers. The movie as a whole has aged and definitely has its flaws, but I think this perfectly encapsulates how social engineering works.</p>\n<figure>\n<iframe width=\"100%\" height=\"auto\" src=\"https://www.youtube-nocookie.com/embed/_G3NT91AWUE?si=APFy9BFpmboUARbo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</figure>\n\n<p>This scene illustrates how simple and innocuous a good social engineering attack can appear, yet how effective it can be. Something akin to this is the most significant and prevalent threat.</p>\n<p>It highlights all the hallmarks of a good social engineering attack. A convincing story, a sense of urgency, and an overwhelming of the victim. They all come together to help the hacker achieve what they want without the need for any messy script writing.</p>\n<p>Social engineering is the most common vector of attack, not traditional &#8216;hacking&#8217; as the media might portray. While it&#8217;s important to have at least a basic security setup, that shouldn&#8217;t be your sole focus. Educate yourself on common social engineering tactics, notably phishing attacks, and maintain a vigilant stance online. Approach all interactions with a healthy dose of scepticism.</p>\n<h2 id=\"antiviruses\">Antiviruses</h2>\n<p>Something I despise and am long overdue to talk about is the fearmongering of antivirus companies. In the modern age, the average consumer does not need to go out of their way to install an antivirus on their device. Despite this, companies will use scare tactics to extort money out of users who know no better.</p>\n<p>Most laptops and desktop computers run Windows, which is a malware mess. That said, I still don&#8217;t recommend going out of your way to install an antivirus, as the Microsoft Defender, which is directly integrated into Windows, is remarkably capable. Just open it up and check that it&#8217;s working at full capacity, and ensure you use Windows Update regularly to keep the definitions at the latest versions.</p>\n<p>Unlike computers, phones operate in a closed ecosystem. Apps are screened for malicious content before being added to app stores. That makes it hard to install malware in the first place. Apps are also usually sandboxed, which stops them from interacting with the system at large and prevents anything that may be malicious from doing any real damage.</p>\n<p>This doesn&#8217;t mean it&#8217;s impossible for phones to be hacked, but it does mean that it&#8217;s a lot harder for it to happen unless you do things outside the norm. It&#8217;s still possible to encounter malware on phones, but an antivirus really isn&#8217;t necessary and will likely do more harm than good.</p>\n<p>While it&#8217;s not worth going out of your way to install an antivirus in the majority of cases, it is worth installing an ad blocker. I&#8217;d recommend <a href=\"https://ublockorigin.com\">uBlock Origin</a>, which is free, open source, and supported on most of the major browsers. uBlock Origin doesn&#8217;t just block ads; it also blocks a lot of phishing material and malware links. Even America&#8217;s FBI <a href=\"https://www.ic3.gov/Media/Y2022/PSA221221\">recommend using an adblocker</a>.</p>\n<h2 id=\"ip-addresses\">IP Addresses</h2>\n<p>One aspect of cybersecurity that often garners outsized concern is the IP address. As the name suggests, it serves as an address, pinpointing the location of a device or a network within the vast expanse of the internet.</p>\n<p>A private IP address identifies a device on a network, while a public IP address signifies a network within the internet. With an IP address, you can glean information such as the ISP that assigned it, a vague geographical location, and some miscellaneous details. However, this information typically lacks significant personal identification.</p>\n<p>This doesn&#8217;t mean it isn&#8217;t possible to use somebody&#8217;s IP maliciously, though. For instance, someone could attempt to launch a Distributed Denial of Service (DDoS) attack to disrupt your network. Unless you&#8217;ve compromised your router&#8217;s security by creating vulnerabilities in your firewall, the potential damage of most attacks is largely mitigated.</p>\n<p>Also, IP addresses are not static; they change periodically. Most consumers have dynamic public IP addresses, meaning their ISP will routinely alter them every few weeks or so.</p>\n<p>Unless you&#8217;ve really gone out of your way to make an enemy, and have poked holes through all the prequipped security, someone knowing your IP isn&#8217;t a huge security threat, although it is worth assessing it as a potential privacy threat.</p>\n<h2 id=\"vpns\">VPNs</h2>\n<p>In the same vein as antiviruses, many Virtual Private Network (VPN) operators employ the same scare tactics and fearmongering regarding issues that haven&#8217;t been relevant for years.</p>\n<p>They especially advertise that they can mask users IPs, which, as discussed previously, isn&#8217;t as important for most people as it may seem. Even if it were hugely important, it just means that your IP is being sent to them instead of elsewhere.</p>\n<p>There is much more to be said about VPNs, but nothing that isn&#8217;t better covered by Tom Scott&#8217;s excellent video, <a href=\"https://www.youtube.com/watch?v=WVDQEoe6ZWY\">&#8220;This Video Is Sponsored By ███ VPN&#8221;</a>.</p>\n<hr>\n<p>Cybersecurity is important, and it&#8217;s worth putting in the time to stay safe. It takes more effort to do damage control than it does to simply stay protected in the first place. If you have any suggestions on additions that I could implement in this article, then I&#8217;d love to hear them in the comments below.</p>\n",
      "date_published": "2024-02-28",
      "id": "https://vale.rocks/posts/cybersecurity-superstition.html",
      "title": "Cybersecurity Superstition",
      "url": "https://vale.rocks/posts/cybersecurity-superstition.html"
    },
    {
      "content_html": "<p>The chances are you&#8217;ve heard of Google Chrome. It&#8217;s currently the biggest browser in the world, but that comes with issues. Issues that I think need addressing. However, it&#8217;s crucial to examine how we reached this stage to form comprehensive opinions. Let&#8217;s start at the start with the birth of the first browser.</p>\n<h2 id=\"the-early-days\">The Early Days</h2>\n<p>In 1990, <a href=\"https://www.w3.org/People/Berners-Lee/WorldWideWeb.html\">WorldWideWeb (later known as Nexus)</a> was released by Tim Berners-Lee for the NeXTSTEP operating system exclusively. This was the first web browser and the sole way to see the web. In 1992, the first stable version of the Line Mode Browser was released, with support for the more widely used X Window System. Following that were many more browsers, such as Erwise and ViolaWWW, and later Cello and Lynx, but there was one that really stood out. Releasing in 1993, the <a href=\"https://www.ncsa.illinois.edu/research/project-highlights/ncsa-mosaic/\">National Center for Supercomputing Applications&#8217; Mosaic</a> came with big changes and huge influence.</p>\n<figure class=\"right\">\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/e/ea/NCSA_Mosaic_Browser_Screenshot.png\" alt=\"A vintage web browser interface displaying the homepage of the National Center for Supercomputing Applications at the University of Illinois. The website is shown in an early version of the Mosaic web browser, with a simple layout and minimal graphics.\" />\n<figcaption>Screenshot of Mosaic version 1.2.</figcaption>\n</figure>\n\n<p>Mosaic was a marked shift. It was the first browser to display images in line with the rest of the content and was notably easier to setup. As with all things in this early stage of the web, it didn&#8217;t stay stagnant for long. Towards the end of 1994, Mosaic began losing its dominance to a new player. Netscape.</p>\n<p>Inspired by the success of Mosaic, Netscape very quickly made a name for itself in the browser arena. It introduced showing content as it downloaded, which made it preferable for the average dial-up user who previously had to wait for the entire page to load before it would display. Its flagship browser, Netscape Navigator, was one of the first to support JavaScript.</p>\n<p>Around this time, Opera emerged. It entered the market with its own proprietary layout engine, titled Elektra.</p>\n<h2 id=\"the-first-browser-war\">The First Browser War</h2>\n<p>Microsoft took notice of Netscape&#8217;s success and saw the internet as a profitable market. They created the now infamous Internet Explorer. Initially considered inferior by many, Explorer began to slowly claw away some market share for itself, gradually chipping away at Navigator and its competitors.</p>\n<p>Netscape Navigator came in two editions: Gold and Standard. With the release of version 4, the Gold Edition (which was notable for having many extra functions that negatively impacted stability) was rebranded to Netscape Communicator. This name change was a shot in the foot that affected their brand recognition and, bundled with performance slower than Microsoft&#8217;s new Internet Explorer 5, spelled their demise.</p>\n<p>By the time the new millennia rolled around, many new browsers had launched (such as <a href=\"https://apps.kde.org/en-gb/konqueror\">KDE&#8217;s Konqueror</a>), Netscape was on its deathbed, and Explorer was thriving, with a peak market share of 95%. Google also began showing some interest in the browser market with the release of Google Toolbar for Internet Explorer. It wasn&#8217;t all sunshine and rainbows for Microsoft&#8217;s browser, though. Microsoft was accused of leveraging its dominant position in the market to unfairly promote Internet Explorer over other browsers to stifle competition.</p>\n<p>This came to a head in 2001 with the ominous sounding United States of America vs Microsoft Corporation. It concluded with Microsoft drafting a settlement proposal that permitted PC manufacturers to use non-Microsoft software.</p>\n<h2 id=\"the-second-browser-war\">The Second Browser War</h2>\n<p>Shortly after this lawsuit, in 2003, Apple released their own browser, Safari, which quickly gained popularity on their Macs, although they initially failed to release it elsewhere. Safari used the WebKit engine, a fork of the KHTML and KJS libraries from KDE&#8217;s browser, Konqueror. Also in 2003, Opera 7 released with a large rewrite and a new layout engine, titled Presto.</p>\n<p>By the time 2004 rolled around, a product concocted by a small group formed by Netscape in 1998 had materialised. The product became Firefox, and the group became the Mozilla Foundation. The same year, rumours began swirling that Google was building a browser of its own.</p>\n<p>Firefox was free, leaving little barrier to entry, and people were more then interested in leaving Internet Explorer, which had gained a reputation for poor security and questionable support for web standards. Firefox also used a unique rendering engine called Gecko and was open source.</p>\n<p>Upon release, Firefox immediately challenged Explorer&#8217;s dominance. Within a mere nine months, the browser had amassed in excess of 60 million downloads. It continued to grow until it&#8217;s peak in 2009, with just over 30% market share.</p>\n<p>Apple realised that they were limiting themselves by only including their browser on their own OS. As such, they released a version for Microsoft Windows. Unfortunately, this couldn&#8217;t have come at a worse time, as the next year Google finally entered the browser market and released Chrome.</p>\n<h2 id=\"the-rise-of-chrome\">The Rise of Chrome</h2>\n<p>Despite initial reluctance from Google CEO Eric Schmidt to enter the browser wars, he eventually relented, and in 2008, Google Chrome released. Using components from Firefox and Apple&#8217;s WebKit, it was built upon Chromium, an open source base also developed by Google. The release was marked with <a href=\"https://www.google.com/googlebooks/chrome/index.html\">a short comic by Scott McCloud</a>.</p>\n<p>It didn&#8217;t see success as instant as Firefox, but instead slowly crept up, to the point that by 2012 it was beating all other major browsers. From that point on, it only continued to grow and has taken complete dominance.</p>\n<p>In 2012, Safari was discontinued for Windows, where its market share had been decimated. However, it&#8217;s continued to remain a popular choice on Apple operating systems.</p>\n<p>The following year, Opera announced its intention to switch from Presto to WebKit, although around the same time, Google announced they would be forking WebKit, to which they were already the largest contributor, to create Blink. Following this, Opera revised their plans and moved to Blink.</p>\n<p>With 2015 came Microsoft&#8217;s attempt to reaffirm their place in the browser market. They unveiled Edge, a new browser built from the ground up with their own engines &#8211; the proprietary EdgeHTML browser engine and open-source JavaScript engine Chakra. Following this unveiling, they announced plans to sunset Internet Explorer and subsequently adopted Edge as the new default browser in Windows.</p>\n<p>Unfortunately for Microsoft, Edge wasn&#8217;t much liked upon release. While praised for performance, it was slandered for its lack of features and poor design choices, among other issues. Microsoft saw this and announced in 2018 that it would rebuild Edge as a Chromium based browser. This move was completed in 2020 and was seen much more favourably.</p>\n<p>This left the web with three major engines: Google&#8217;s Blink, Mozilla&#8217;s Gecko, and Apple&#8217;s WebKit. Almost every browser currently in existence relies on one of these three engines.</p>\n<p>Apple&#8217;s WebKit sees significant use on its own devices. Safari is the browser of choice for most MacOS users, as it&#8217;s preinstalled. WebKit also sees unanimous use on both iOS and iPadOS, where all browsers are relegated to merely a front for it. It also sees a degree of use in embedded applications thanks to its performant nature and in some other browsers.</p>\n<p>Mozilla&#8217;s Gecko sees very minimal use outside of Firefox. It is used by a few Firefox forks, but very little beyond that.</p>\n<p>Google&#8217;s Blink sees the most use by far. This is what this article has been building up to and where the issues lie. Almost everything uses Blink.</p>\n<p>Edge? Blink. Opera? Blink. Opera GX? Blink. Vivaldi? Blink. Brave? Blink. Samsung Internet? Blink. UC? Blink. Silk? Blink. Arc? Blink.</p>\n<p id=\"showChromium\" style=\"display:none;\">\nIf you&#8217;re wondering, the browser you&#8217;re reading this article in is Chromium based.\n</p>\n\n<script>\n    if (!!window.chrome) {\n        document.getElementById(\"showChromium\").style.display = 'block';\n    }\n</script>\n\n<p>But it goes beyond that. It&#8217;s not only the engine used by most of the most popular browsers; it&#8217;s also the engine that powers <a href=\"https://www.electronjs.org\">Electron</a>. Thus, the desktop applications for Discord, Spotify, VS Code, Figma, Obsidian, Signal, Slack, <a href=\"https://www.electronjs.org/apps\">et al</a> are all using Blink. It&#8217;s everywhere!</p>\n<h2 id=\"the-problem-with-chrome\">The Problem with Chrome</h2>\n<p>There is no choice in the browser market. It&#8217;s all just Blink, and Blink is Google. This means that Google has complete and absolute control over the browser market. Bundle this with the most popular search engine, and they have near complete control over the web.</p>\n<p>This simply isn&#8217;t acceptable. The web, at its core, is open. That is what was defined when it was created, and that is how it must stay. Almost everyone on this planet relies on the web in some way or another, and the idea that a single entity can control the entire thing is preposterous.</p>\n<figure class=\"right\">\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/8/83/Google_Chrome_96_Windows_11.png\" alt=\"The interface of Google Chrome displaying the browser's minimalistic design with tabs, address bar, and navigation buttons. The browser is open to the Wikipedia homepage.\" />\n<figcaption>Screenshot of Google Chrome version 96.</figcaption>\n</figure>\n\n<p>If you&#8217;ve been reading attentively, you may remember the comic I mentioned that was released alongside Chrome. Well, in 2022, <a href=\"https://contrachrome.com\">a parody released</a> with a few changes. It outlines a few of the things that Google is doing within Chrome that have far-reaching implications. Beyond all the spying, the comic touches on something of particular interest: the advent of Manifest v3 and its implications.</p>\n<h3 id=\"manifest-v3\">Manifest v3</h3>\n<p>Most browsers have support for the WebExtensions API, which is a system for developing extensions that can be used across browsers. These extensions require a file called <code>manifest.json</code> that defines metadata, behaviour, and an assortment of other information.</p>\n<p>Naturally, this specification has evolved over time. The latest iteration is Manifest v3. It attempts to address issues regarding privacy, security, and performance. Namely, it embraces service workers, prevents remotely hosted code, and depreciates the webRequest API.</p>\n<p>This is, in general, a good thing. Extensions are a huge attack vector with potential for malicious use, and the changes introduced by Manifest v3 act to lessen their potential impact. Unfortunately, these changes also restrict the capabilities of extensions, especially content blockers.</p>\n<p>Blocking adverts, trackers, and the likes isn&#8217;t just a nice-to-have anymore &#8211; it&#8217;s a near on required tool for safe web browsing. Even the <a href=\"https://www.ic3.gov/PSA/2022/PSA221221\">FBI recommends you use an adblocker</a>.</p>\n<p>Content blockers are severely restricted in functionality under Manifest v3 as a result of the depreciation of the webRequest API, which is used to block content prior to it loading.</p>\n<p><a href=\"https://ublockorigin.com\">uBlock Origin</a>, one of the most popular content blockers around, has had to release a <a href=\"https://chromewebstore.google.com/detail/ublock-origin-lite/ddkjiahejlhfcafbddmgiahcphecmpfh\">&#8216;lite&#8217; version</a> with lesser functionality as a result of these changes, and many other extensions, mainly those that boost privacy and reduce data collection, will be hit the hardest.</p>\n<p>Google is a company that makes the bulk of its revenue through advertising and data collection. Perhaps it&#8217;s conspiracy to think that they&#8217;re making these changes to bolster their income, but it certainly isn&#8217;t hurting it. This is a change that is being pushed by Google, and a change that Google has the most to gain from.</p>\n<p>Manifest v3 is <a href=\"https://blog.mozilla.org/addons/2022/05/18/manifest-v3-in-firefox-recap-next-steps\">also being adopted by Firefox</a> to ensure interoperability, though they don&#8217;t intend to phase out v2 for the foreseeable future.</p>\n<h3 id=\"accelerated-mobile-pages\">Accelerated Mobile Pages</h3>\n<p>Accelerated Mobile Pages (AMP) is another excellent example of the problems with Google having power. AMP is a framework that aims to improve the performance of web content, particularly on mobile. It improves speed by restricting certain elements and optimising content delivery. While these are great intentions, they&#8217;ve seen much good criticism.</p>\n<p>One large criticism is that it gives Google a huge amount of control over the way content is displayed on the web, which influences how things are built and monetized. It also has impacts on privacy and security.</p>\n<p>Another criticism is that Google prioritises AMP links above others, potentially impacting the visibility of non-AMP content. Google&#8217;s &#8220;Top Stories&#8221; section, which is located above the main search results, exclusively displayed AMP links. This more or less forced publishers into using AMP if they wanted any exposure. They only removed the AMP requirement in 2021 after <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.564903/gov.uscourts.nysd.564903.152.0_1.pdf\">facing legal threats</a>.</p>\n<p>AMP is just another way that Google has shown that they are not content with simply existing within the web but instead wish to control it. If you&#8217;d like to read more about AMP and its impact, then I&#8217;d suggest <a href=\"https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot\">this Reddit post</a> from the creator of the <a href=\"https://amputatorbot.com\">Amputator bot</a>.</p>\n<h3 id=\"web-environment-integrity\">Web Environment Integrity</h3>\n<p>In April of 2023, some Google engineers <a href=\"https://github.com/RupertBenWiser/Web-Environment-Integrity\">created a GitHub repository</a> explaining the details of a proposal for Web Environment Integrity (WEI). Despite huge negative feedback, code started being implemented into Chromium in preparation for implementation. Fortunately, the proposal was abandoned in November, and what had been implemented was removed, although a replacement for Android WebViews titled &#8220;Android WebView Media Integrity API&#8221; was swiftly proposed and looks to enter testing in early 2024.</p>\n<p>You may be wondering exactly what it is. WEI is more or less a way to verify that a site is &#8216;genuine&#8217;. It can be best described as Digital Rights Management (DRM) for the web and, wouldn&#8217;t you know, could&#8217;ve also impacted ad blockers if they were found to be altering the web environment&#8217;s integrity. Perhaps the impact of WEI most relevant to this article is the fact that browsers, especially those out of the mainstream or that offer unique or uncommon features, might have found themselves considered &#8216;untrusted&#8217; and therefore severely limited.</p>\n<p>I could continue with further examples, but I think the point is made, and I expect you&#8217;ve gathered the picture. The web is dominated by Chrome, and something needs to be done about it.</p>\n<h2 id=\"the-death-of-firefox-support\">The Death of Firefox Support</h2>\n<p>As Bryce Wray illustrates in his article <a href=\"https://www.brycewray.com/posts/2023/11/firefox-brink/\">&#8220;Firefox on the Brink?&#8221;</a> the US Web Design System mandates official support for browsers exceeding 2% usage on US Government-run websites. A similar requirement is <a href=\"https://www.gov.uk/service-manual/technology/designing-for-different-browsers-and-devices\">set by the British government</a>. As he suggests, it may be a lot sooner than we expect that Firefox loses consideration for compatibility during development. I very much recommend reading his article for discussion on the topic.</p>\n<h2 id=\"taking-action\">Taking Action</h2>\n<p>You&#8217;re likely wondering what you can do. The answer is simple: support healthy competition and use a browser based on something other than Chromium. The best bet would be using Firefox or something based on it. Firefox is free, open source, available on most platforms, and Mozilla has largely shown a commitment to both the user and the web.</p>\n<p>If you&#8217;re coming from one of the more flashy &#8216;cutting edge&#8217; browsers like Arc or Opera GX, then <a href=\"https://zen-browser.app\">Zen</a> will provide a very similar experience. If you&#8217;re looking for something with privacy in mind like Brave or the DuckDuckGo browser, then you can try <a href=\"https://librewolf.net\">LibreWolf</a> or <a href=\"https://mullvad.net/browser\">Mullvad Browser</a>. If you require anonymity or need to avoid censorship, then you might consider the <a href=\"https://www.torproject.org\">Tor Browser</a>.</p>\n<p>As the web&#8217;s future depends on diversity in browse engines, you might also consider supporting the development and growth of emerging projects:</p>\n<ul>\n<li><p><a href=\"https://servo.org\">Servo</a> is a web rendering engine started by Mozilla back in 2012 that is now handled by the Linux Foundation. It&#8217;s pretty far along in development and is beginning to see real-world deployment, such as use in embedded applications.</p>\n</li>\n<li><p><a href=\"https://ladybird.org\">Ladybird</a> is a very new and ambitious project intending to build out a full web browser complete with it&#8217;s own rendering and JavaScript engines fully independent of existing browser engines.</p>\n</li>\n</ul>\n<hr>\n<p>Share the message of browser engine diversity. Preserving an open web is crucial. The more people understand what&#8217;s at stake, the better chance we have of preventing failure. If you&#8217;d like to help me make more content like this, please consider <a href=\"/support\">supporting me</a>.</p>\n<details>\n<summary>Sources</summary>\n\n<ul>\n<li><a href=\"https://eylenburg.github.io/browser_engines.htm\">History of Web Browser Engines from 1990 until today</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://www.w3.org/People/Berners-Lee/WorldWideWeb.html\">Tim Berners-Lee: WorldWideWeb, the first Web client</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://www.ncsa.illinois.edu/research/project-highlights/ncsa-mosaic\">NCSA Mosaic™ - NCSA</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://gs.statcounter.com/browser-market-share\">Browser Market Share Worldwide | Statcounter Global Stats</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://www.zdnet.com/article/did-the-browser-wars-finally-end-in-2014\">Did the browser wars finally end in 2014? | ZD Net</a> | Accessed 10/12/2023</li>\n<li><a href=\"https://www.google.com/googlebooks/chrome/index.html\">Google Chrome</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://contrachrome.com\">Contra Chrome - a webcomic - How Google&#8217;s browser became a threat to privacy and democracy</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://openwebdefenders.org\">Web Environment Integrity: What&#8217;s Going On?</a> | Accessed: 12/12/2023</li>\n<li><a href=\"https://www.brycewray.com/posts/2023/11/firefox-brink\">Firefox on the brink? | BryceWray.com</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://www.gov.uk/service-manual/technology/designing-for-different-browsers-and-devices\">Designing for different browsers and devices - Service Manual - GOV.UK</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://gds.blog.gov.uk/2012/01/25/support-for-browsers\">Browsers we support and why - Government Digital Service</a> | Accessed: 10/12/2023</li>\n<li><a href=\"https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot\">Why did I build AmputatorBot?</a> | Accessed: 06/03/2024</li>\n<li><a href=\"https://blog.mozilla.org/addons/2015/08/21/the-future-of-developing-firefox-add-ons\">The Future of Developing Firefox Add-ons</a> | Accessed: 03/11/2024</li>\n<li><a href=\"https://blog.mozilla.org/addons/2022/05/18/manifest-v3-in-firefox-recap-next-steps\">Manifest v3 in Firefox: Recap & Next Steps</a> | Accessed: 03/11/2024</li>\n<li><a href=\"https://ublockorigin.com/\">uBlock Origin - Free, open-source ad content blocker</a> | Accessed: 03/11/2024</li>\n</ul>\n</details>\n",
      "date_published": "2023-12-11",
      "id": "https://vale.rocks/posts/everything-is-chrome.html",
      "title": "Everything Is Chrome",
      "url": "https://vale.rocks/posts/everything-is-chrome.html"
    },
    {
      "content_html": "<p>If you had asked me at the start of 2023 my opinion on Halo, I wouldn&#8217;t have had anything to say. I&#8217;d played 10 minutes of multiplayer with my cousin the better part of a decade ago, but that was it. Since then, I&#8217;ve played through every single mainline Halo game, from Combat Evolved to Infinite. This article catalogues my opinions on each of the games in the order I played them. I played all of the games on my Xbox Series S as part of the Master Chief Collection (MCC), with the exception of 5 and Infinite, which I played through their standalone games. I&#8217;ll only be discussing the campaigns, as I have scarcely touched the multiplayer.</p>\n<p>I&#8217;ll be avoiding spoilers for the most part, but if I&#8217;ve got any specifics to mention, I&#8217;ll place them in a &#8220;Campaign Specifics&#8221; drop-down at the conclusion of the relevant entry. This means that even if you haven&#8217;t touched the series, you can rest assured this article shouldn&#8217;t ruin your experience. That said, just go play the games; they&#8217;re generally worth it. I also just want to give thanks to my friend Sebastien, who advised me to get into the series. &#8216;Twas a good call.</p>\n<h2 id=\"halo-combat-evolved\">Halo: Combat Evolved</h2>\n<p>Halo: Combat Evolved, often abbreviated to CE, is the first game in the series. It sets up what is to come and sets it up well. The gunplay feels terrific, the gameplay is sublime, and the story holds audience attention without ever getting in the way.</p>\n<p>Right off the bat, I&#8217;d like to mention the Anniversary edition. Releasing in 2011, it features a complete overhaul of all the graphics. While it looks fantastic in the right conditions, it has some <em>issues</em>. Many of the textures and models are ripped straight from Halo 3 and Reach [^1] and aren&#8217;t faithful to the original release, which alters the tone and impacts the story telling.</p>\n<p>This is especially prevalent in later missions, where what should be dark, dingy, and foreboding is bright, sterile, and innocuous. The palette is more saturated, and the textures are detailed to the point of being overwhelming. Where the original graphics tie into the horror element of requiring you pull out a flashlight to navigate a dimly lit, unfamiliar environment, the Anniversary graphics will have you trying to lower your brightness to avoid a visual overload.</p>\n<p>Not only that, but the bounding boxes of countless objects don&#8217;t line up quite as you&#8217;d expect. On the occasion that I attempted playing with the anniversary graphics, I consistently found disparities in level geometry eating my bullets.</p>\n<p>That&#8217;s why, despite the original graphics having most definitely aged, I personally chose them for my playthrough. The new ones can be a spectacle when presented correctly, but otherwise miss the mark and degrade the experience. Fortunately, you can toggle between them at your convenience. It can genuinely be somewhat fun to flick back and forth to observe the changes.</p>\n<figure class=\"right\">\n<img src=\"https://halo.wiki.gallery/images/3/37/HCE-MasterChief-Wallpaper.jpg\" alt=\"The Master Chief in green armour leading marines up a beach. In the background is a Warthog, dead enemies, and a Pelican.\" />\n<figcaption>A Halo: Combat Evolved promotional image.</figcaption>\n</figure>\n\n<p>With my graphical gripes out of the way, my mind turns to the iconic theme CE introduces. I don&#8217;t quite know how to express my love for this theme; it&#8217;s superb. It is super versatile, with each variant cleanly slotting into the situation that calls for it. Whether it&#8217;s a slow piano version in an emotional moment or a fast, intense version in the heat of battle, the theme, in conjunction with the rest of the soundtrack, immediately acts to define an atmosphere and pull the audience into the moment.</p>\n<p>I&#8217;ll also note that the Anniversary edition comes with a new, re-recorded, remixed soundtrack. It&#8217;s different and not completely faithful to the original. While not necessarily bad, it captures the wrong mood and changes the overall &#8216;sound&#8217; of the original. Most of this comes from the mixing, where subtleties are lost and emphasis is redirected.</p>\n<p>Halo has some deep religious undertones that manifest throughout the series, starting with CE. Perhaps most blatantly, the name of the game, Halo, refers not just to the ring-world on which it&#8217;s set but also the crown of light surrounding the heads of sacred people in many religions. The vocals of the soundtrack derive from Gregorian chants originating from the Roman Catholic Church, and there are many finer, more subtle references throughout that, while not necessarily obvious in CE, proceed to establish themselves in later entries.</p>\n<p>Combat Evolved&#8217;s campaign opens strong with a solid introduction. It starts off with some weapon-free navigation of the ship before diving into some exposition and then transitioning into close-quarters corridor-based combat. This serves to help new players grasp the basics of movement, positioning, and operation of their weapons in a forgiving environment while not feeling overbearing for anyone with a gaming background.</p>\n<p>It then proceeds to, like many good games, slowly but surely introduce more mechanics, weapons, and interactions without ever feeling overwhelming. It&#8217;s not perfect, and the weapons aren&#8217;t necessarily super balanced <em>(the pistol in this game may as well be a sniper rifle.)</em>, but it ticks the most important box. It&#8217;s fun.</p>\n<p>If you&#8217;re looking to get into the FPS genre, then it&#8217;s a good game to start with. If you&#8217;re looking to get into Halo, then it&#8217;s <em>the</em> game to start with [^2]. It&#8217;s also a good game to stop with, if you just want to dip your toes in and aren&#8217;t sure if Halo is your cup of tea. It has a nice conclusion that, while being rather open-ended, supplies an easy and satisfying stopping point.</p>\n<details>\n<summary>Campaign Specifics</summary>\n\n<p>There is a certain sense of awe that sets in post-crash as you step out of the escape pod and look up for the first time. Seeing Halo wrap into the sky for the first time is really something to behold.</p>\n<p>While pretty consistently a stellar experience, one level stands as an exception: <em>The Library</em>. Not only must you deal with the ever-irritating 343 Guilty Spark for the level&#8217;s entirety, but you must also battle through several monotonous, repetitive, copy-pasted, Flood-filled chambers that are a clear symptom of <a href=\"https://en.wikipedia.org/wiki/Halo:_Combat_Evolved#Move_to_Xbox\">Bungie&#8217;s development crunch</a>.</p>\n</details>\n\n<h2 id=\"halo-2\">Halo 2</h2>\n<p>Halo 2 looks at CE, throws out what didn&#8217;t work, iterates on and improves what did, and then cranks everything up to 11. The stakes are high, and the quality is higher. The seamless integration of intense action sequences and stellar storytelling create an immersive experience that kept me firmly on the edge of my seat.</p>\n<p>Where I felt the need to complain about CE&#8217;s Anniversary graphics, I feel the need to celebrate Halo 2 Anniversary&#8217;s. You can quite comfortably play the game with or without the overhaul and be confident you&#8217;re experiencing the game to its fullest. They remain faithful to the original while looking stunning, and, much like with CE&#8217;s, they can be toggled at will to verify this.</p>\n<p>Of particular beauty are the cutscenes. Crafted by Blur Studio, the cutscenes are marvellous. They&#8217;re detailed and crisp, looking more sharp and real than reality itself, but not overwhelmingly so. Part of my decision to play with Anniversary graphics was just to ensure I didn&#8217;t miss them.</p>\n<figure class=\"right\">\n<img src=\"https://halo.wiki.gallery/images/2/2c/H2A_-_Regret.png\" alt=\"The High Prophet of Regret, a alien with wrinkled and textured brownish skin, large black eyes, and a small mouth. He is wearing an elaborate gold and black helmet with curved horns on the sides.\" />\n<figcaption>The High Prophet of Regret sitting on his throne in Halo 2: Anniversary&#8217;s graphics.</figcaption>\n</figure>\n\n<p>That said, the original graphics don&#8217;t slouch either. While there are some slight regressions thanks to a pivot in lighting tech mid-development, models are much more detailed, meaning the game takes on a less stylised, more &#8216;realistic&#8217; approach.</p>\n<p>While Halo 2 keeps most of its predecessor&#8217;s music, it also manages to elevate it with the inclusion of some truly epic electric guitar. The guitar elevates the music to something somehow even more exhilarating than what CE accomplished.</p>\n<p>Much like with CE&#8217;s Anniversary release, Halo 2 Anniversary features a re-recorded and remixed re-release of the soundtrack. Thankfully, much like with the graphics, it takes a step up from the CE&#8217;s. While some tracks have unfortunately been replaced, it&#8217;s generally mixed much better and more faithfully to the original, making it an excellent listen.</p>\n<p>The gameplay sees several improvements, with dual wielding, destructible and hijackable vehicles, and reduced fall damage taking the game a monumental step forward. These enhancements somehow push the game into something even more dynamic and immersing than CE.</p>\n<p>Starting very similarly to CE with a subtle close quarters tutorial, it doesn&#8217;t take long to diverge into a much richer, more expansive story. This story is punctuated by writing and choreography that would later be improved in Halo 3.</p>\n<p>One thing that does irk me is the ending. The game concludes with quite the cliffhanger thanks to Bungie, more or less, creating the entire game in about 9 months and having to slice the game pretty much in half to push it out in time. That said, the half they sliced off went on to lay a solid groundwork for the next game in the series, Halo 3.</p>\n<details>\n<summary>Campaign Specifics</summary>\n\n<p>Like many other players, I was a bit confused when I loaded into the sixth mission, The Arbiter, and found myself playing not as the Chief, but as the alien from the cutscene. While it was a bit of a shock at first, it didn&#8217;t take long to get acclimated, and his ability to enable 10 seconds of active camouflage introduced interesting gameplay opportunities.</p>\n</details>\n\n<h2 id=\"halo-3\">Halo 3</h2>\n<p>While being the conclusion to Bungie&#8217;s original trilogy, Halo 3 is really the conclusion to Halo 2. It serves to tie up 2&#8217;s cliffhanger and loose ends while itself being a complete package with a well-fitting conclusion that provides appropriate closure.</p>\n<p>Being released relatively early into the 360&#8217;s lifespan, Halo 3 may not compare to the graphical fidelity that 360 games would later achieve, but it has a lot of charm and a distinct art style that more than makes up for it. The cutscenes of 3 expand on the direction of 2 and are animated in an almost cartoony nature that provide a wonderful sense of energy that cement them as my favourites of the series and perhaps my favourite part of Halo 3 altogether.</p>\n<p>I can&#8217;t say it&#8217;s my favourite game in the series from a gameplay perspective, as it didn&#8217;t really add much to the experience other than deployable equipment and the gravity hammer. While I didn&#8217;t find myself using the equipment all that often, I did love the gravity hammer. A super powerful melee weapon that sends enemies into the stratosphere with ease. The lethality and power paired with its animations make it feel weighty and menacing. The game also excelled at continuing the story and did an admirable job broadening the in-game universe.</p>\n<h2 id=\"halo-3-odst\">Halo 3: ODST</h2>\n<p>ODST follows the Orbital Drop Shock Troopers, a subset of the UNSC marines that drop in from the sky in specialised pods to aid in battle. This is the first game in which you don&#8217;t play as Master Chief at all. Instead, you take the reins of the Rookie, an ODST. This leads to the game being a captivating departure from the previous games in the series. You don&#8217;t get the armour or strength of a Spartan, and this shows in the gameplay.</p>\n<figure class=\"right\">\n<img src=\"https://halo.wiki.gallery/images/thumb/1/16/H3ODST_CoverArt_Logoless.png/1599px-H3ODST_CoverArt_Logoless.png?20200828103447\" alt=\"An orbital drop shock trooper in armor stands in the rain with a weapon, with dilapidated buildings and a ship in the somber background. The entire image is monotone blue.\" />\n<figcaption>Halo 3: ODST&#8217;s promotional art with text and overlays removed.</figcaption>\n</figure>\n\n<p>This game is notably different to the rest of the series, and it&#8217;s best experienced on a harder difficulty. ODST plays best when a slip-up ends you in the most dire of situations. I had the most fun when, on recommendation of my friend Sebastien, I played on a harder difficulty on a dark, raging evening. You need to feel scared and take care because you aren&#8217;t playing as the Master Chief. You&#8217;re the marines that you&#8217;ve witnessed fall around you during the last 3 campaigns. You must take much more care as you play, although it would have been nice for the difference to perhaps been a tad more pronounced.</p>\n<p>The graphics in this game are a noticeable, albeit minor, step up from Halo 3. Everything from the textures to the lighting, just looks better. It&#8217;s also bathed in that sepia tone that the seventh generation of game consoles are known for.</p>\n<p>The music of this game, much like the gameplay, is a sound departure from Halo tradition. Gone is the orchestral grandeur of previous games, and in is <em>smooth jazz</em> (blues is probably a better description, but smooth jazz is much more humorous). While it may seem peculiar, it&#8217;s oddly fitting. The blues, jazz, and noir influences have a notable impact on the game&#8217;s urban and mysterious setting. It relies on ambient sounds to create an atmosphere that captures the feeling of walking through dark, rain-soaked streets, perfectly constructing a sense of isolation and introspection.</p>\n<p>The story is told by very different means, with the player piecing it together through flashbacks, the environment, and objects littered throughout it. The story also differs in its order. Where previous campaigns were strictly linear, ODST allows the player to play the missions in the order they choose. While this is a lovely idea, the missions still lead into each other, and the player is forced to go out of their way to play them any differently than was intended.</p>\n<p>Overall though, this different style of storytelling creates a very unique experience that pairs elegantly with the style of gameplay ODST strives for.</p>\n<h2 id=\"halo-reach\">Halo Reach</h2>\n<p>Reach is, in my opinion, the best game in the Halo series. I won&#8217;t say too much here out of fear of spoiling it for someone, but it is so very good. In all honesty, I came very near to giving up on Reach towards the beginning. After having already played four games from the series, I was starting to tire. Following ODST, I kinda just wanted to jump back into the story as Master Chief and was chasing that high of the original trilogy. I&#8217;m so extremely glad I saw it through though for the game is stunning in every aspect.</p>\n<p>Gameplay-wise, it improved on the equipment mechanic from Halo 3 by incorporating Armour Abilities, a more varied, refined equipment system. It also improves on the weapons, with everything having a distinct and recognisable purpose. The enemy AIs also see a marked improvement and are considerably more fun to fight with troops, such as the Elites, moving a lot more erratically.</p>\n<p>The music of Reach is wonderful. Much like ODST, it strays away from the series&#8217; iconic Gregorian chant. Reach doesn&#8217;t wander as far as ODST though as its vocals and strings remain very reminiscent of the theme found in the mainline games. What really makes Reach&#8217;s soundtrack is the game&#8217;s simple leitmotif, as heard at the start of <a href=\"https://www.youtube.com/watch?v=ecIY7-xnkuQ\">Long Night of Solace</a>. The swelling strings instantly pull me into the melancholy feeling of Reach.</p>\n<p>Being released towards the end of the Xbox 360&#8217;s lifespan, the graphics are a huge jump from anything seen in the Halo series previously. This is unfortunately the last game in the series worked on by Bungie, the series creators.</p>\n<details>\n<summary>Campaign Specifics</summary>\n\n<p>I touched on almost giving up on Reach. I felt this way for a number of reasons. The first level, Winter Contingency, was just kinda dull. It didn&#8217;t do anything really interesting, and that set the tone for the first half of the game. Don&#8217;t get me wrong, it wasn&#8217;t terrible, just alright. Where it really picks up is with the level Long Night of Solace. The story starts to get deeper, the tone darkens, the stakes increase.</p>\n<p>Members of Noble team start dropping, and the game takes on a whole new feeling. A feeling of emptiness as the impending doom setup from the opening starts to reach you. As your team slowly dies and you&#8217;re tasked with delivering Cortana to the Pillar of Autumn, it just clicks. The game simply falls into place.</p>\n<p>What really cemented my love for Reach was the epilogue. As you fight the losing battle against the Covenant on the planet&#8217;s surface, there is nothing you can do but try to survive. You can&#8217;t keep them off forever, and nothing you do will change the looming outcome. Your death is imminent, just as the very start of the game alluded to.</p>\n</details>\n\n<h2 id=\"halo-4\">Halo 4</h2>\n<p>Halo 4 is pretty good. It&#8217;s not the best, but it&#8217;d be a misjustice not to say it&#8217;s a worthy addition to the series. This is the first game to be developed exclusively by new series holder, 343 Industries, a subsidiary of Microsoft constructed exclusively for creating Halo games.</p>\n<figure class=\"right\">\n<img src=\"https://halo.wiki.gallery/images/thumb/9/9c/H4-E3-Campaign-7.jpg/1600px-H4-E3-Campaign-7.jpg\" alt=\"First-person perspective of a player holding a futuristic assault rifle in a lush jungle environment, firing at a Promethean enemy that's disintegrating upon being hit, with a heads-up display showing health, ammunition, and radar.\" />\n<figcaption>Screenshot of Halo 4&#8217;s campaign.</figcaption>\n</figure>\n\n<p>Prior to getting into Halo, my modern AAA gaming experience was very much limited. I was a bit young for shooters when the 360 was in its prime and mostly used the console for Kinect games and a bit of Minecraft. I was shocked to see just how well Halo 4 holds up. It&#8217;s hard to comprehend that within one console generation we went from Halo 3, to Halo 4. It&#8217;s not perfect by modern day standards, but it&#8217;s still impressive and holds its own.</p>\n<p>This makes it all the more a shame that the art style lets it down. Styling is repetitive, with very little variation, and what does exist spits in the face of the Bungie games. Were it a unique title this would be a non issue, but to throw away what had been so well defined left me disappointed. It still looks good, but it could have been so much better.</p>\n<p>The new enemies, the Prometheans, also weren&#8217;t my favourite to fight. Unlike the Convenant, they have no personality. Grunts chatter and show cowardice. Elites are big, burly, and lead the fight. Jackals hang back and attack from a distance. Each are unique and seem like they could exist outside the context of combat.</p>\n<p>All the Prometheans are emotionless husks that exist purely as things to shoot at. The weapons they drop, while incredibly well designed, are dull to use and run out of ammo frequently. This would be a minor issue if they weren&#8217;t all bullet sponges that take a lifetime to kill. Unfortunately, you can&#8217;t use the UNSC weapons you&#8217;ve grown familiar with either, given that there is next to no ammo for them around.</p>\n<p>I don&#8217;t mind Halo 4; it&#8217;s an alright game. It certainly isn&#8217;t the best in the series, but it&#8217;s far from being the worst. As you&#8217;ll see, Halo 5 holds that title.</p>\n<details>\n<summary>Campaign Specifics</summary>\n\n<p>Story wasn&#8217;t entirely Halo 4&#8217;s strong suite. Exposition was heavy handed, and I failed to click with the Didact&#8217;s story. That said, it wasn&#8217;t all bad. Master Chief&#8217;s character is handled with grace, and he is fleshed out an appropriate amount without impacting the ability for the player to project onto him. It&#8217;s also done tastefully, with Cortana acting as a nice medium to develop him.</p>\n<p>On the topic of Cortana, the ending scene between her and the Chief is executed with nuance. It really couldn&#8217;t have been pulled off better. It&#8217;s impressive how well they managed to convey Chief&#8217;s emotion to the player without removing his helmet. The Halo TV show should take notes.</p>\n</details>\n\n<h2 id=\"halo-5-guardians\">Halo 5: Guardians</h2>\n<p>This game could be better titled <em>&#8220;Call of Duty: In Space&#8221;</em>. It doesn&#8217;t feel like Halo. It doesn&#8217;t look like Halo. It doesn&#8217;t play like Halo.</p>\n<p>It&#8217;s almost like 343 Industries chucked away everything from Bungie&#8217;s entries, took the worst bits from 4, reconstituted them, and mixed them in with the most soulless shooter they could find.</p>\n<p>It&#8217;s bland slop without a hint of seasoning advertised behind the façade of a Halo entry.</p>\n<p>This game outright refused to save my progress. At one point, I walked through a railing that had no collision and plummeted to my death. This set me back an entire hour of gameplay. For the rest of the game, I played on easy. I completed the bulk of this game in one sitting. Not because I enjoyed it, but because I was worried that I&#8217;d have to replay a large chuck of the game I was coming to loathe for the second time if I stopped.</p>\n<p>One of the few positive things I can say about this game is that <a href=\"https://www.youtube.com/watch?v=44oJi5w2Wjc\">the opening cutscene looks outstanding</a>.</p>\n<p>Seeing as this game is exclusively available on the Xbox, I wouldn&#8217;t sweat it if you can&#8217;t play it. Read a plot summary, watch the cutscenes, and move onto the next game in the series.</p>\n<details>\n<summary>Campaign Specifics</summary>\n\n<p>What the hell is the story of this game? It plays out like poorly written fanfiction one might find in a late night Archive of Our Own binge. If the rest of the issues this game boasts didn&#8217;t condemn it enough, then the story is just another pile of dirt upon its coffin.</p>\n<p>I vehemently oppose the decision to bring back Cortana, especially after the fitting send off she received in the climax of 4. Speaking of Cortana, in this game she looks fine graphically, but her design is, in my opinion, a marked regression from 4, which had all but perfected her.</p>\n</details>\n\n<h2 id=\"halo-infinite\">Halo Infinite</h2>\n<p>Halo Infinite is a true return to formula. I believe that this is what Bungie wanted to make when they created Combat Evolved. CE was intended to take place in an open world, but it simply wasn&#8217;t feasible on the hardware of the original Xbox.</p>\n<figure class=\"right\">\n<img src=\"https://halo.wiki.gallery/images/b/bc/HINF_XGS_2020_Grappleshot_in_use.jpg\" alt=\"The Master Chief from the Halo series, clad in his Mjolnir Infinite armor. He is depicted holding his helmet under his arm and gripping a grappling hook, with the number 117 emblazoned on his chest plate. An orange, cloud-filled sky serves as the backdrop, highlighting the detail and design of the armor.\" />\n<figcaption>The Master Chief in his Halo Infinite armour.</figcaption>\n</figure>\n\n<p>The game plays exceptionally. The grappleshot is a wicked gameplay addition that allows Master Chief to swing and traverse the new open world map. Speaking of the new open world structure, its implementation is marvellous. It permits free movement without jeopardising the flow of the game or story.</p>\n<p>The entire experience looks top-notch. It&#8217;s realistically realistic. It doesn&#8217;t make every bit of metal so shiny; it&#8217;s overwhelming and instead looks more like a higher quality Halo 2. The somewhat cartoony qualities of the cutscenes are back from 3 and really shake off the stiffness of the previous entry. Master Chief&#8217;s armour also looks the best it ever has. It&#8217;s got a new level of intricacy and realism unmatched by any of the other games.</p>\n<p>The only critique of its visuals that comes to mind is the lack of stylistic diversity. We&#8217;re thrown into a huge open-world, but the surface is almost exclusively the same generic forest, occasionally broken up by big hexagons, the void, and copy pasted Forerunner structures. It would have been lovely just to see a tad more variety, like we see in the multiplayer maps.</p>\n<p>This installment also marks the return of the legendary music. It&#8217;s a triumphant return of the iconic theme as heard in CE. It once again adapts to context with ease and shows how much this game is pushing forward while staying true to the franchise&#8217;s roots.</p>\n<p>The story repairs the mess of the previous two games and paves the way for the future. I really do look forward to seeing how they build on what was setup in Infinite and what the next instalment brings to the table.</p>\n<hr>\n<p>I hope that you gained something reading about my thoughts on Halo. I&#8217;d love to hear your thoughts and opinions on the franchise, so leave them in the comments.</p>\n<h2 id=\"footnotes\">Footnotes</h2>\n<p>[^1]: So is the multiplayer. It simply stripped out the original and just bundled a modified version of Reach&#8217;s. This isn&#8217;t an issue on the MCC, as it features the original multiplayer, but if you&#8217;re playing on the 360, I&#8217;d recommend just going and tracking down the original Xbox version. You can run it on the 360 via backwards compatibility.\n[^2]: You might have read that Reach is the first game. It&#8217;s a prequel, released after Halo ODST. I very much recommend experiencing the games (and most media, for that matter) in chronological release order.</p>\n",
      "date_published": "2023-08-27",
      "id": "https://vale.rocks/posts/halo-my-thoughts.html",
      "title": "Halo: My Thoughts",
      "url": "https://vale.rocks/posts/halo-my-thoughts.html"
    },
    {
      "content_html": "<p>I like computers, and I like tinkering. I also don&#8217;t mind stretching rules a little if it means I can do something not intended. I&#8217;ve burnt hours customising CFW on consoles, tinkering with the inner workings of computers (not always mine), and gaolbreaking iPhones.</p>\n<p>I&#8217;ve been a fan of the sort of stuff <a href=\"https://hak5.org\">Hak5</a> produces for a while, but I&#8217;m no professional pentester, and I honestly can&#8217;t see myself using their offerings all that often. That&#8217;s why the Flipper jumped out to me. A device that condenses the functionality of many of their gizmos into a sleek, pocketable device.</p>\n<p>It struck me as just the sort of thing to scratch my itch, so I went about getting one.</p>\n<h2 id=\"buying\">Buying</h2>\n<p>When looking to buy a Flipper on the <a href=\"https://flipperzero.one\">official Flipper Zero website</a>, I was redirected to Joom Geek, Flipper&#8217;s official Australian distributor and &#8216;tech&#8217; sub-brand of Joom.</p>\n<p>Joom is very much like Aliexpress, Wish, or Temu. Lots of plastic gadgets of objectionable quality at prices so low that you can&#8217;t help but wonder what questionable labour practices have been employed. In the case of the Flipper Zero though, these cheap prices didn&#8217;t apply, and the cost came out to $322 AUD with shipping.</p>\n<p>I ordered the Flipper on March 19th, but it wasn&#8217;t until a month later, on April 20th, that I was updated with the information that my &#8220;package departed the seller&#8217;s warehouse&#8221;. Funnily enough, a day previously, on April 19th, I had submitted a query asking the status of my order, given that a month had passed with no update.</p>\n<p>Anywho, I did eventually receive it on May 20th. I will say that Joom&#8217;s slow shipping, bad reputation, and lack of communication did sketch me out a bit, but in fairness, I did receive it in one piece. I&#8217;d have preferred to buy from the official marketplace, but I&#8217;m really just glad I got it in the end.</p>\n<h2 id=\"setup\">Setup</h2>\n<p>After removing the shipping packaging, I extracted the compact cardboard box that contained the quick start guide, a short USB-C to USB-A cable, a sticker, and the Flipper itself. Everything was packed in the box snug with foam.</p>\n<p>All I had to do was peel off the plastic screen cover, hold the back button, and it sprung to life.</p>\n<p>I had done quite a bit of research prior to pulling the trigger on purchasing the Flipper, and even more in the time it took for it to arrive, so I had a pretty good idea of what I was gonna do once I got it.</p>\n<p>I had the briefest of plays with the official firmware, which was fine, but I knew that the limitations of the firmware were going to hold back my plans for the device. That&#8217;s why I jumped to the Momentum firmware.</p>\n<p>Thanks to the Flipper&#8217;s <a href=\"https://github.com/flipperdevices/flipperzero-firmware\">open source firmware</a>, there are many community led forks. During my initial research, <a href=\"https://flipper-xtre.me\">Xtreme</a> seemed to be the best available, but internal conflicts led to it being forked and rebranded as <a href=\"https://momentum-fw.dev\">Momentum</a>.</p>\n<p>Momentum has several benefits over the stock firmware. Standouts for me include improved customisation options through the management app, better menus, battery charge capping, and a sane set of bundled apps. It also allows bypassing artificial limitations, such as the ones imposed by the SubGHz region lock, although this is something I most definitely don&#8217;t do as a law abiding citizen.</p>\n<p>It isn&#8217;t hard to install and can be done via a web browser, the qFlipper desktop management program, or the mobile app. I&#8217;ve done it via web and mobile with no issues. It&#8217;s just as smooth as installing the standard firmware.</p>\n<h2 id=\"features-and-capabilities\">Features and Capabilities</h2>\n<p>Once I had the Flipper properly setup, I dove straight into mischief. First action was cloning the TV remote so I&#8217;d be able to mildly inconvenience anyone at my discretion. This sort of IR cloning is super easy, simply open the necessary app, set it to learn, point the relevant remote at the Flipper&#8217;s sensor, and press whatever button you want to capture.</p>\n<figure class=\"right\">\n<img src=\"/assets/posts/i-got-a-flipper-zero/flipper-zero-on-table.avif\" alt=\"A picture of a Flipper Zero sitting on a table.\" />\n<figcaption>My Flipper Zero</figcaption>\n</figure>\n\n<p>This sort of interaction has defined my usage of the Flipper. Receive a signal and play it back. It&#8217;s a real world copy paste. In fact, that is probably the best way to describe the Flipper for anyone curious about what exactly it is. It&#8217;s a copy and paste for the world&#8217;s signals.</p>\n<p>One thing I was worried about was that the novelty of the device would wear off quickly, and I wouldn&#8217;t touch it again. Well, the novelty did wear off, but what it was replaced with is arguably better. Utility. The Flipper has taken the position of my keys and wallet in my right jean pocket.</p>\n<p>The device is slated as a &#8220;multi-tool device for geeks&#8221; on the official website, and I don&#8217;t think a better description could be written. Much like a multitool, it&#8217;s something I <em>always</em> want on me.</p>\n<p>I think the multitool branding also sets expectations right. You don&#8217;t buy a multitool expecting it to replace your toolbox. You buy a multitool expecting a compact jack of all trades that is convenient to pocket. It isn&#8217;t a replacement for specialised tools; it&#8217;s a convenient, versatile supplement to them.</p>\n<h2 id=\"utility\">Utility</h2>\n<p>Part of always wanting it on my person is down to just how handy it&#8217;s been. I haven&#8217;t had it long, but it is such a useful little nugget and does so much. I&#8217;ve noted some of my favourite uses for it here, but the list is far from exhaustive. It can do <em>so</em> much.</p>\n<p>Perhaps one of the most common uses is as a remote control for TVs, set top boxes, VHS players, DVD players, Hi-Fi systems, air conditioners, lights, etc. If it&#8217;s been in my proximity and has infrared capabilities, then I&#8217;ve captured its signals. Being able to change the volume on the TV without having to send a search party out for the remote is one thing, but there are many devices I encounter with absent remotes where the Flipper is invaluable. I can either try brute force the codes or consult the <a href=\"https://github.com/logickworkshop/Flipper-IRDB\">very comprehensive IRDB</a>, which contains remotes for everything from clocks to bidets.</p>\n<p>The feature of the Flipper that has saved me the most time is by far the BadUSB functionality. I can write scripts and, by emulating a USB keyboard, execute them on devices at my discretion. It&#8217;s handy for automating a slew of tasks, but perhaps the most useful I&#8217;ve set up runs a quick Windows Update, a Windows Security scan, and does a disk cleanup.</p>\n<p>In the same vein as the BadUSB functionality, it&#8217;s handy as a remote for computers. You can pair it over Bluetooth or using it&#8217;s USB-C cable and do anything you might need. Acting as a clicker during presentations, as a media control, or as a mouse jiggler to fein activity are all super useful.</p>\n<p>The subGHz functionality is something I want to do more with. Most devices have <a href=\"https://en.wikipedia.org/wiki/Rolling_code\">rolling codes</a>, which makes it difficult for the Flipper to interface with them, but there are definitely use cases I want to explore. Worth noting is that the charge port caps on Teslas respond to a subGHz signal and have no authentication or rolling codes. Do with this information as you will.</p>\n<p>The NFC functionality is also pretty neat. Most cards are encrypted, but things like Amiibo are fair game. Sure beats carrying a plastic figure around.</p>\n<h2 id=\"build-and-battery\">Build and Battery</h2>\n<p>One of the first things that struck me about the Flipper was just how solid it is. It has a bit of weight to it, with a robust plastic case that doesn&#8217;t creak nor flex. I can feel pretty confident that it won&#8217;t fail during normal usage.</p>\n<p>The only issue with the build that I can point to is the pogo pins included for the iButton functionality. They&#8217;re perhaps a bit fragile, which leads to worry whenever I find them catching on my pants when sliding it in and out of my pockets.</p>\n<p>As for the battery, I can only say good things. When Flipper claims it can last for <a href=\"https://docs.flipper.net/basics/power\">&#8220;up to one month&#8221;</a>, they aren&#8217;t kidding. I was initially worried about battery life, so I turned off Bluetooth when not in use, but that wasn&#8217;t really necessary. I can happily use the Flipper and place it in standby mode with Bluetooth on without concern that the battery will be dead the next time I go to use it.</p>\n<h2 id=\"ethics-and-legality\">Ethics and Legality</h2>\n<p>The Flipper is a &#8216;hacking&#8217; tool. &#8216;Hacking&#8217; comes with a bad rep. The second somebody mentions hacking, it&#8217;s assumed you&#8217;re trying to bust into a Gibson or something of that nature.</p>\n<p>Obviously, the Flipper should be used responsibly. To bring up the multitool analogy once again, I could use the knife on a multitool to hold someone hostage or horrifically injure them. That doesn&#8217;t mean that I necessarily will though, and it certainly doesn&#8217;t mean multitools should be blanket banned.</p>\n<p>There are many a lawmaker of the impression that the Flipper is a tool of evil. This isn&#8217;t the case, or at least not if used responsibly. The Flipper isn&#8217;t just evil, and it isn&#8217;t just a toy. It&#8217;s a tool.</p>\n<p>We&#8217;ve seen previously that the Flipper can <a href=\"https://www.theverge.com/2023/11/3/23944901/apple-iphone-ios-17-flipper-zero-attack-bluetooth\">identify and highlight exploitable weaknesses</a>, and that the knowledge gained from its usage <a href=\"https://www.theverge.com/2023/12/15/24003406/apple-iphone-flipper-zero-fix-ios-17-2\">can lead to fixes</a>. If Flippers were banned, there is a decent likelihood that such exploits would persist without detection or that a similar device would emerge to take its place.</p>\n<p>It is a tool - a very fun tool - and it should be treated as such. Inherently, it&#8217;s no more evil than a pocket knife. It&#8217;s how it&#8217;s used and the intent behind usage that matters.</p>\n<h2 id=\"community\">Community</h2>\n<p>One thing that both inspires and disappoints me is the community surrounding the Flipper. Through Reddit and, to a lesser extent, the forums, there is a hostile culture.</p>\n<p>I think fake viral posts on platforms such as TikTok have perhaps skewed expectations and embellished the Flipper&#8217;s capabilities. This has attracted novice users with warped understandings, who are at odds with the more technical crowd that tends to push the limits of the device and handle community led support.</p>\n<p>There tends to be a RTFM approach slung at users unfamiliar with support etiquette and a general culture of downvoting those that ask simple questions. While I do think it is important to direct people towards the proper documentation instead of spoon feeding them, the hostility should be left at the door. The echo chamber that is Reddit is particularly guilty of this, and better must be done.</p>\n<p>Separate from the negativity, there is a thriving community that dedicates their time to expanding, and experimenting with, the Flipper&#8217;s feature set.</p>\n<p>As discussed with the Momentum firmware previously, much of the Flipper is open source, and the tooling to hack and build on it is readily available. This has led to a <a href=\"https://lab.flipper.net/apps\">thriving app ecosystem</a> and countless hardware addons that make use of the GPIO pins. Perhaps my favourite class of which are the <a href=\"https://github.com/nmrr/flipperzero-geigercounter\">Geiger</a> <a href=\"https://github.com/eried/flipperzero-flippenheimer\">counters</a>.</p>\n<h2 id=\"overall-evaluation\">Overall Evaluation</h2>\n<p>The Flipper Zero is a neat bit of tech. It&#8217;s an all in one, pocket sized tinkerer&#8217;s toolbox. No, it isn&#8217;t better than buying specialised hardware for each of its features, but that isn&#8217;t its goal. It fills the niche encapsulated by the ethos behind the quote, &#8220;the best camera is the one you have with you&#8221;. It&#8217;s built well and fulfils its purpose.</p>\n<p>If the Flipper has made it onto your radar and piqued your interest, then chances are the only negative you&#8217;ll find in buying it is the impact on your wallet.</p>\n<hr>\n<p>I hope you got something out of my review of the Flipper. If you did, then do consider sharing it, and if you&#8217;d like to see me produce more content like this, consider <a href=\"/support\">supporting me</a>.</p>\n",
      "date_published": "2024-06-14",
      "id": "https://vale.rocks/posts/i-got-a-flipper-zero.html",
      "title": "I Got A Flipper Zero",
      "url": "https://vale.rocks/posts/i-got-a-flipper-zero.html"
    },
    {
      "content_html": "<p>My first phone was a RugGear RG930. If you think Nokia&#8217;s <a href=\"https://www.gsmarena.com/nokia_3310-192.php\">3310</a> was built like a brick, then this thing may as well have been a rubberised titanium brick. It was so sturdy I used to play &#8216;catch the phone&#8217; with friends, and it ended up face down on concrete more times than I can count, but I don&#8217;t think it ever sustained so much as a scratch.</p>\n<p>As time progressed, I decided I wanted something a <em>tad</em> more featured, and later ended up with the <a href=\"https://www.gsmarena.com/apple_iphone_se-7969.php\">first generation iPhone SE</a>, a phone that was endlessly reliable when it wasn&#8217;t stuck in a bootloop thanks to my love of gaolbreaking. It was already a few years old by the time I got my hands on it, so it wasn&#8217;t much of a surprise when the battery started to degrade and I found myself looking for its replacement.</p>\n<p>That replacement came in the form of the <a href=\"https://www.gsmarena.com/nokia_2720_flip-9836.php\">Nokia 2720</a>, a charming little flip phone. It was a nugget of a device, and I used it for a few years. It didn&#8217;t have support for anything fancy, but that wasn&#8217;t its intention. It was a simple communication device and served that purpose well. At least until it shed the D-pad, the company supporting the OS disappeared, and it started to take issue with my telco.</p>\n<p>As a result, I decided the time was ripe to move back to the world of smartphones. I was intrigued by Nokia&#8217;s latest offering, the <a href=\"https://www.gsmarena.com/nokia_g22-12137.php\">G22</a>.\n<a href=\"/blog/A_Year_With_The_Framework_Laptop\">Much like my Framework</a>, it was advertised as repairable, with support coming directly from iFixit. It also touted a long battery life, headphone jack, SD card tray, and an affordable price. It ticked all my boxes. I waited for reviews, and they were almost unanimously positive. I found it for a good price, bundled with a case and speaker, and bought it.</p>\n<p>I opened it up to find myself wading through a bog of bloatware and crap. I loaded my contacts, photos, and other materials and went on with my day to get a feel for the device. A day or two later, I found myself needing to make a call, so I opened up the contacts app to an empty screen with all my contacts absent.</p>\n<p>I reimported a backup, and once again, everything was purged the next time I tried to use it. I figured, no stress, I&#8217;ll go use another contact app. Same issue. Something on the phone was purging my contacts. Then my messaging app started crashing every time I opened it.</p>\n<p>I decided I&#8217;d make the move to a custom ROM to escape the issues and figured it&#8217;d be a breeze. After all, it&#8217;s a device billed as repairable, and developer options showed it supported OEM unlocking. I checked out <a href=\"https://lineageos.org\">LineageOS</a> only to find it was unsupported. I decided to search online, and after cutting my way through waist high AI generated SEO articles, discovered that none exist for the phone.</p>\n<p>I thought about trying my hand at making one, but discovered that HMD has failed to comply with the GPL and hasn&#8217;t distributed the source needed. <a href=\"https://www.hmd.com/en_int/opensource\">As you can see on this page</a>, there is no G22 listed.</p>\n<figure class=\"right\">\n<img src=\"https://www.chooseyourmobile.com/wp-content/uploads/2023/02/Nokia-G22-Image.jpg\" alt=\"A side, back, and front view of the Nokia G22 in the colour 'Lagoon Blue'.\" />\n<figcaption>The Nokia G22 from a few angles.</figcaption>\n</figure>\n\n<p>I decided to simply reset the phone in the hope that the issues were user error. No luck; same issues. I decided I&#8217;d reset it again and replace all the apps I could with alternatives from F-Droid to see if it fixed any of the issues. Unfortunately, it did not. While many of the apps themselves were excellent, they still relied on the cooked version of Android to function. The phone&#8217;s software has let me down, and the lack of alternate ROM options doesn&#8217;t help.</p>\n<p>The absolute worst part of the experience would have to be logging in. The experience is often something like this:</p>\n<ol>\n<li>Place finger on fingerprint reader.</li>\n<li>Phone vibrates but screen doesn&#8217;t turn on.</li>\n<li>Press power button to turn on the screen.</li>\n<li>The screen brightness plummets to the lowest value.</li>\n<li>Press the power button again to turn the phone off.</li>\n<li>Press power button to turn on the screen.</li>\n<li>Fingerprint fails to recognise.</li>\n<li>Give up on fingerprint reader.</li>\n<li>Swipe up on lock screen and enter pin.</li>\n</ol>\n<p>I&#8217;ve tried varying my actions in every possible way, and this roundabout mess is the only way I can reliably get into the phone when it happens. Even across system resets and reenrolments of my prints, it&#8217;s persisted. It doesn&#8217;t happen every time, but it happens enough to thoroughly infuriate and inconvenience.</p>\n<p>The phone also fails to reenable network functionality after entering battery saver mode, and Bluetooth often refuses to work unless I restart the phone. Updates haven&#8217;t been as frequent as advertised, either. The Nokia name truly has fallen from grace. While the phone does look rather nice and <a href=\"https://unsplash.com/collections/Puec3W1Cf3g/new-zealand\">can take decent pictures</a>, it&#8217;s all overshadowed by its issues.</p>\n<p>Realistically, Nokia as we know it has been dead for a while. While they may have stood strong in the 90s and early 2000s, they actively fought the flow of progress as it rushed past them. They refused to join the Open Handset Alliance, instead investing in the ill fated Symbian Ltd and its increasingly obsolete operating system.</p>\n<p>As Symbian stumbled, Nokia attempted to replace it with MeeGo (another Linux based mobile OS). While this saw positive attention, it wasn&#8217;t to be as Nokia entered into a partnership with Microsoft the very same year they released their first (and ultimately last) MeeGo phone.</p>\n<p>This partnership saw Nokia embrace Windows Phone. They quickly became the most prominent Windows Phone manufacturer, making up most of the sales through 2013 with their Lumia series. However, Nokia began experimenting with Android on their phones, and Microsoft, worried what might happen should they lose their biggest OEM, purchased their mobile phone division outright.</p>\n<p>Unfortunately for Microsoft, Windows Phone wasn&#8217;t quite the success they&#8217;d been hoping for, and a decline over the next few years saw the project completely dead by the end of the decade. In recent years, the mobile phone division sold to Microsoft has been living as HMD Global, although they&#8217;ve made strides to <a href=\"https://www.hmd.com/en_int/blog/hmd-makers-of-nokia-phones-and-more\">differentiate themselves from the Nokia brand</a>.</p>\n<p>I can only hope that HMD&#8217;s refocusing leads to their products improving, as what they&#8217;re currently offering is truly poor. Ultimately, I moved away from Nokia and bought a Pixel 7a. It&#8217;s not perfect, and the lack of headphone jack irks me, but at the very least it supports custom ROMs such as <a href=\"https://grapheneos.org\">GrapheneOS</a>.</p>\n<hr>\n<p>If you liked my review of the Nokia G22, then do consider sharing it. Also, if you’d like to see me produce more content like this, then <a href=\"https://vale.rocks/support\">financial support is very much appreciated</a>.</p>\n",
      "date_published": "2024-02-03",
      "id": "https://vale.rocks/posts/i-hate-my-nokia.html",
      "title": "I Hate My Nokia",
      "url": "https://vale.rocks/posts/i-hate-my-nokia.html"
    },
    {
      "content_html": "<p>There is no doubt you&#8217;re familiar with GIFs, PNGs, and JPEGs. These image formats have been <em>the</em> way to display images on computers for decades. Chances are you see hundreds, if not thousands, of them every day while you browse the web.</p>\n<p>Yet these formats aren&#8217;t quite as ubiquitous as they once were, and we&#8217;ve seen many competing standards materialise in the past few years. Perhaps most promising is JPEG XL, yet its innovation seems to go unrecognised and its adoption is stifled. But why? To get a full picture, I think it&#8217;s best we start with the advent of displaying images on computers.</p>\n<h2 id=\"a-brief-history\">A Brief History</h2>\n<p>Since we&#8217;ve had computers, we&#8217;ve been trying to display images on them. We started by using various text characters and symbols to bodge things together in terminals. This obviously wasn&#8217;t ideal and merely means to an end. The first actual image formats to see any real popularity included <a href=\"https://en.wikipedia.org/wiki/PCX\">PCX</a>, <a href=\"https://en.wikipedia.org/wiki/Truevision_TGA\">TGA</a>, <a href=\"https://en.wikipedia.org/wiki/PICT\">PICT</a>, and <a href=\"https://en.wikipedia.org/wiki/BMP_file_format\">BMP</a>.</p>\n<p>However, these early formats were rudimentary. They largely lacked compression and weren&#8217;t widely supported. It was an era when every piece of software rolled their own format and interoperability wasn&#8217;t a priority. This was an issue, and as the need for greater compatibility grew, some proper standards formed. Of these, GIF, JPEG, and PNG are probably the best known and relevant today.</p>\n<p>GIF, short for Graphics Interchange Format, is messy. It released in the &#8217;80s, uses the simple Lempel–Ziv–Welch compression algorithm, and is limited to a palette of a meagre 256 colours. In today&#8217;s landscape, it looks pretty rough, but it&#8217;s managed to stick around thanks to its great software support and animation capabilities.</p>\n<p>JPEG, also referred to as JPG and short for Joint Photographic Experts Group, came out in the early &#8217;90s. While it does have a lossless variant, it is largely used as a lossy format. However, the degree of compression can be controlled, unlike many other formats, which allows users to select the trade off between quality and size. It&#8217;s great compression and early debut led to it becoming the most widely used format.</p>\n<p>An attempt was made to supersede JPEG with the very retro futuristic sounding, but ultimately ill fated, &#8220;JPEG 2000&#8221;. It had some neat features and functionality, such as being able to compress specific sections independently, but never saw widespread adoption.</p>\n<p>During the &#8217;90s, following GIF&#8217;s widespread adoption, the Unisys Corporation, which owned the patent on the Lempel–Ziv–Welch compression algorithm used by GIFs, attempted to enforce its licensing. This ultimately led to much discourse, and a more open, improved alternative was developed. It was aptly unofficially dubbed &#8220;PNG&#8217;s Not GIF&#8221;, which, of course, abbreviates to the recursive acronym PNG, though officially, it stands for &#8220;Portable Network Graphics&#8221;. The format spread due to its free, open nature, and good support for transparency by means of an alpha layer.</p>\n<p>These three standards all managed to secure footing early in the web&#8217;s life and defined themselves as <em>the</em> image formats for many years. They haven&#8217;t been perfect, but they&#8217;ve generally worked and seen great support.</p>\n<h2 id=\"a-new-age\">A New Age</h2>\n<p>It isn&#8217;t all sunshine and roses for these ageing formats, though. The world has moved around them. Back when these formats were devised, computing power was a scarce resource. Many devices didn&#8217;t hold the power to compress things on the fly without performance implications, and the web was in its infancy.</p>\n<p>Over the past 30 odd years, our devices, software, and knowledge of them have come a long way, yet these ageing formats still remain. That&#8217;s why, in recent years, we&#8217;ve seen a shift to new formats. Ones that aren&#8217;t limited to the compression algorithms of the &#8217;90s, and are instead more optimised and usable in the modern age.</p>\n<h3 id=\"enter-webp\">Enter WebP</h3>\n<p>In 2010, two years after the release of their Chrome browser, Google announced WebP. They proceeded to develop and refine it until its eventual stable release in 2018. The goal was simple. Make a format with the quality of a JPEG, the transparency of a PNG, and the animation of a GIF, in a small package.</p>\n<p>As expected for a Google product, it very quickly gained support in Chromium, even in its unstable phase. Safari and Firefox didn&#8217;t receive full support until after its stable release, and many complaints from users stating that websites designed exclusively with Chrome in mind would fail to render the format.</p>\n<p>Once all browsers received support, Google very quickly began working to snuff out other formats. They made several changes, such as updating PageSpeed Insights to suggest that sites serve images as WebP files rather than competing formats.</p>\n<h3 id=\"announcing-avif\">Announcing AVIF</h3>\n<p>About a year after WebP&#8217;s full introduction, a competing standard, AVIF, had its first full release. The intention was for the format to succeed WebP, and while it does implement features that aren&#8217;t present in WebP, such as HDR support, it lacks in other features, such as support for resolutions over 4K. Realistically, this places AVIF in no man&#8217;s land. It wasn&#8217;t a direct upgrade to the standards it was competing against when it released, and it certainly isn&#8217;t now.</p>\n<p>One edge it does have is its use of AV1. AV1 as a video coding format already had a strong footing by the time AVIF came onto the scene. As AVIF uses the same format, just for images rather than videos, a lot of the prerequisite work a format needs to go through to see adoption had already been done.</p>\n<p>Thanks to many browsers having already implemented AV1 for the purpose of video, AVIF managed to see quick adoption. In August of 2020, Chromium received support for the format, with Firefox enabling support in October of 2021 and Safari implementing support throughout 2022.</p>\n<h3 id=\"introducing-jpeg-xl\">Introducing JPEG XL</h3>\n<p>Having been finalised in 2021, JPEG XL is a rather new format, and a good one at that. It&#8217;s created by the same group as the original JPEG and based off of <a href=\"https://github.com/google/pik\">Google&#8217;s Pik proposal</a> and <a href=\"https://github.com/cloudinary/fuif\">Cloudinary&#8217;s FUIF</a>.</p>\n<figure class=\"right\">\n<picture>\n\t<source srcset=\"/assets/posts/jpeg-xl-and-googles-war-against-it/jxl-support.jxl\" type=\"image/jxl\">\n\t<img src=\"/assets/posts/jpeg-xl-and-googles-war-against-it/no-jxl-support.avif\" alt=\"Image stating 'Your browser supports JPEG XL' or 'Your browser doesn't support JPEG XL' depending on browser support.\" />\n</picture>\n</figure>\n\n<p>Looking at <a href=\"https://en.wikipedia.org/wiki/Comparison_of_graphics_file_formats\">Wikipedia&#8217;s Comparison of Graphics File Formats</a>, it&#8217;s evident that it trumps every other raster image format. Some of its many features include:</p>\n<ul>\n<li>Choice of lossy or lossless compression.</li>\n<li>Perfectly reversible, lossless conversion from JPEG with ~20% savings.</li>\n<li>~60% smaller file sizes than JPEG at the same quality when using lossy compression.</li>\n<li>Negligible compression artefacts when using lossy compression.</li>\n<li>Great colour gamut support, including HDR, and support for other channels.</li>\n<li>Super fast encoding and decoding.</li>\n<li>Support for progressive decoding.</li>\n<li>Tiny file header at a mere 12 bytes.</li>\n<li>Everything WebP and AVIF boasts, including transparency, animations, and such.</li>\n<li>Licensed openly with no royalties.</li>\n<li>Up to 32 bit depth</li>\n<li>Insanely high maximum resolution up to 1,152,921,502,459 megapixels (that&#8217;s <em>over a trillion</em> pixels total).</li>\n<li>Resilient against generational loss.</li>\n</ul>\n<p>From reading those points, you may have gathered that it does everything that could be expected of a format and does it well. Given that it excels in every context, you might expect that it&#8217;d be the de facto standard, yet, alas, it sees minimal browser support.</p>\n<p>So, why were WebP and AVIF picked up so quickly when JPEG XL wasn&#8217;t? Well, as you may have surmised from the article&#8217;s title, it&#8217;s largely down to Google.</p>\n<h2 id=\"googles-exploitation-of-their-dominance\">Google&#8217;s Exploitation of Their Dominance</h2>\n<blockquote>\n<p>[!NOTE]\nI&#8217;ll be discussing Chrome&#8217;s dominance and Google&#8217;s exploitation of it for their own gain. I&#8217;ve written about this at length in my article <a href=\"/posts/everything-is-chrome\">Everything Is Chrome</a>, which I advise you read prior to this section.</p>\n</blockquote>\n<p>Google has cemented itself as the single controlling force of the web. What they say goes. Google Search is the most popular search engine, and Chromium is the base for the majority of browsers. This means they control both what pages get recommended in search, and how they&#8217;re displayed in browser.</p>\n<p>This leaves them with a lot of power. If they take issue with JPEG XL, then they can single handedly stop its adoption, and that&#8217;s exactly what they&#8217;ve done. At one point, Google actually did add support for JPEG XL to Chromium behind a flag. It was implemented and functional in Chromium. This prompted Firefox to add their own support.</p>\n<p>However, it never made it past the opt in flag support stage, and Google eventually removed it, stating <a href=\"https://issues.chromium.org/issues/40168998\">in the Chromium Issue Tracker</a>:</p>\n<blockquote>\n<p>&#8220;Thank you everyone for your comments and feedback regarding JPEG XL. We will be removing the JPEG XL code and flag from Chromium for the following reasons:</p>\n<ul>\n<li>Experimental flags and code should not remain indefinitely</li>\n<li>There is not enough interest from the entire ecosystem to continue experimenting with JPEG XL</li>\n<li>The new image format does not bring sufficient incremental benefits over existing formats to warrant enabling it by default</li>\n<li>By removing the flag and the code in M110, it reduces the maintenance burden and allows us to focus on improving existing formats in Chrome&#8221;</li>\n</ul>\n</blockquote>\n<p>This rightly caused an uproar. Users pointed out many flaws in their claims. Firstly, that there has been a huge interest in the standard from a huge number of individuals and organisations, and secondly, the innovation brought by JPEG XL was most definitely &#8220;sufficient incremental benefits&#8221;, especially as they had recently accepted AVIF, which was more lacking in features than existing standards.</p>\n<p>What this really translates to is, &#8220;We&#8217;ve created WebP, a competing standard, and want to kill anything that might genuinely compete with it&#8221;. This would also partly explain why they adopted AVIF but not JPEG XL. AVIF wasn&#8217;t superior in every way and, as such, didn&#8217;t threaten to dethrone WebP.</p>\n<p>JPEG XL, however, <strong>is</strong> better than WebP in every quantifiable way and would obsolete it. AVIF also serves as something to point to should they be called out for stifling competition and innovation as they are. They can simply say, &#8220;We love other formats. Look, we added another one just the other year&#8221;.</p>\n<p>Interestingly, Firefox, which receives a pretty decent amount of funding from Google, quietly dropped focus on implementing JPEG XL support and now state that they are &#8220;neutral&#8221; on the matter, although the flag is still present in the nightly version of the browser. Safari, which is developed by Apple separately from Google, managed to implement JPEG XL support with no issues, and it&#8217;s available in WebKit without limitation.</p>\n<p>Many forks of Chromium and Firefox also include support with no ill effect. Firefox based browsers can simply enable the flag, and Chromium based browsers can use the implementation prior to removal as a jumping off point.</p>\n<p>Some of the forks with support include <a href=\"https://thorium.rocks\">Thorium</a>, <a href=\"https://www.waterfox.net\">Waterfox</a>, and <a href=\"https://www.palemoon.org\">Pale Moon</a>. The code is written and working, and both use external implementations, so the cited &#8220;maintenance burden&#8221; is more or less nonexistent. Even if it does turn out to be a huge burden, <a href=\"https://lunduke.locals.com/post/4387539/firefox-money-investigating-the-bizarre-finances-of-mozilla\">they can take the hit</a>.</p>\n<h3 id=\"why-webp\">Why WebP?</h3>\n<p>So, Google sabotaged JPEG XL in favour of their own format, WebP. The question is, <em>why?</em> Well, I think that&#8217;s pretty clear. Google wants complete control, and JPEG XL could take that away from them. They already have unrivalled control over the web, so why not expand that just a bit more?</p>\n<p>Should Google decide they need to make some alterations to the format to benefit themselves, there is next to nothing standing in their way. They&#8217;ve got control over the standard and can make tweaks if needed. Especially the sort of business minded tweaks that are employed to better align with stakeholder interests.</p>\n<p>Google could also stop supporting the format outside their products and services, leading to them faltering and falling out of compatibility. This could lead to fragmentation and compatibility issues in non-Google software, potentially pushing users to move to Google&#8217;s offerings where support is offered.</p>\n<h2 id=\"taking-action\">Taking Action</h2>\n<p>It may seem futile, but I believe that if we raise awareness of the issue and put enough public pressure on Google and, to a lesser extent, Mozilla, they will reconsider their stance. Use browsers that support the format, or toggle on the flag if possible. Spruik the benefits of the format wherever you can attract attention, and start using it in the <a href=\"https://jpegxl.info/why-jxl#software_support\">various software that already supports it</a>. The more demand, the more adoption.</p>\n<p>This is an effort that is worth fighting for. Google has trampled innovation far too many times in the pursuit of control for us to allow them to do it again. We must condemn this behaviour and fight these monopolistic practices at every turn to prevent stifling progress in the name of corporate control.</p>\n<hr>\n<p>If you liked this article, then do consider sharing it, both for my own benefit and to raise awareness. Also, if you&#8217;d like to see me produce more content like this, then consider <a href=\"/support\">sending me a tip</a>. It&#8217;d mean a lot.</p>\n<details>\n<summary>Sources</summary>\n\n<ul>\n<li><a href=\"https://issues.chromium.org/issues/40168998\">JPEG XL decoding support (image/jxl) in blink (tracking bug) [40168998] - Chromium</a> | Accessed: 23/04/2024</li>\n<li><a href=\"https://people.apache.org/~jim/NewArchitect/webrevu/1997/05_09/designers/05_09_97_1\">Web Review: PNG&#8217;s NOT GIF!</a> | Accessed: 01/05/2024</li>\n<li><a href=\"https://caniuse.com/?search=jpeg%20webp\">&#8220;jpeg webp&#8221; | Can I use&#8230; Support tables for HTML5, CSS3, etc</a></li>\n<li><a href=\"https://jpegxl.info\">JPEG XL</a>| Accessed: 24/04/2024</li>\n<li><a href=\"https://jpeg.org/jpegxl\">JPEG - JPEG XL</a> | Accessed: 23/04/2024</li>\n<li><a href=\"https://ds.jpeg.org/whitepapers/jpeg-xl-whitepaper.pdf\">JPEG XL White Paper 2.0 - jpeg-xl-whitepaper.pdf</a> | Accessed: 28/04/2024</li>\n<li><a href=\"https://cloudinary.com/blog/how_jpeg_xl_compares_to_other_image_codecs\">How JPEG XL Compares to Other Image Codecs</a> | Accessed: 23/04/2024</li>\n<li><a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1539075\">Open Bug 1539075 (JPEG-XL) Implement support for JPEG XL (image/jxl)</a> | Accessed: 23/04/2024</li>\n</ul>\n</details>\n",
      "date_published": "2024-05-01",
      "id": "https://vale.rocks/posts/jpeg-xl-and-googles-war-against-it.html",
      "title": "JPEG XL and Google's War Against It",
      "url": "https://vale.rocks/posts/jpeg-xl-and-googles-war-against-it.html"
    },
    {
      "content_html": "<p>This is a page in which I test and trial formatting, features, and typography by seeing how they interact in complex arrangements to catch edge cases. If you&#8217;d like to read the logic behind all of this, check out <a href=\"/posts/the-design-of-this-site\">The Design of This Site</a>.</p>\n<h2 id=\"text-formatting\">Text Formatting</h2>\n<p>Escaping markdown can be done with *some slashes* (like so <code>\\*some slashes\\*</code>).</p>\n<p>Normal text. <em>Italic text.</em> <strong>Bold text.</strong> <strong><em>Bold italic text.</em></strong> <del>Strikethrough text.</del> <del><em>Italic strikethrough text.</em></del> <del><strong>Bold strikethrough text.</strong></del> <del><strong><em>Bold italic strikethrough text.</em></strong></del> <code>Code text.</code> <em><code>Code italic text.</code></em> <strong><code>Code bold text.</code></strong> <strong><em><code>Code bold italic text.</code></em></strong> <del><code>Code strikethrough text.</code></del> <del><strong><em><code>Code bold italic strikethrough text.</code></em></strong></del></p>\n<p>Normal superscript<sup>sup</sup>. Normal subscript<sub>sub</sub>. <em>Italic superscript<sup>sup</sup></em>. <em>Italic subscript<sub>sub</sub>.</em> <strong>Bold superscript<sup>sup</sup></strong>. <strong>Bold subscript<sub>sub</sub>.</strong> <strong><em>Bold italic superscript<sup>sup</sup></em></strong>. <strong><em>Bold italic subscript<sub>sub</sub>.</em></strong> <del>Strikethrough superscript<sup>sub</sup>.</del> <del>Strikethrough subscript<sub>sub</sub>.</del> <del><strong><em>Bold italic strikethrough superscript<sup>sup</sup></em></strong></del>. <del><strong><em>Bold italic strikethrough subscript<sub>sub</sub>.</em></strong></del></p>\n<p>Superscript and subscript together<sup>sup</sup><sub>sub</sub>.</p>\n<p>You can define structure with <abbr title=\"Hypertext Markup Language\">HTML</abbr> then style it with <abbr title=\"Cascading Style Sheet\">CSS</abbr>. You can do more interactive stuff with <abbr title=\"JavaScript\">JS</abbr>.</p>\n<p>You can do a hard refresh on a webpage using <kbd>Ctrl</kbd> + <kbd>Shift</kbd> + <kbd>R</kbd></p>\n<h3 id=\"heading-levels\">Heading Levels</h3>\n<p>Quod provident corporis natus. Voluptatem sunt magnam nobis quo quas repudiandae magnam. Qui maxime dolor harum. Aspernatur tempore ea id sed fugit. Dolores cum tenetur in quisquam et maiores quam. Suscipit est aperiam rerum consectetur velit officiis.</p>\n<h4 id=\"heading-level-4\">Heading Level 4</h4>\n<p>Aliquam non sed beatae. Deleniti laborum ut eveniet autem. Aut incidunt sint ex ut occaecati. Praesentium et ut cumque beatae.</p>\n<h5 id=\"heading-level-5\">Heading Level 5</h5>\n<p>Quaerat deleniti quos accusamus sit qui. Est temporibus fugiat cupiditate aut sit hic ex cum. Ea quaerat non dolor et iure repellendus velit. Nihil ea tempore ut libero aperiam nulla aut necessitatibus. Est praesentium fuga rerum aut ipsa et aut id.</p>\n<h6 id=\"heading-level-6\">Heading Level 6</h6>\n<p>Aliquam laborum voluptate molestiae illo sunt dolorum. Qui fuga qui fuga impedit libero tenetur ex aliquam. Sit molestiae ut sint nulla deserunt molestiae eos veritatis. Neque perferendis culpa ad omnis. Ipsum nisi facere cum molestiae aut possimus exercitationem repellat. Voluptatum blanditiis optio officiis et quo.</p>\n<h3 id=\"links\">Links</h3>\n<p><a href=\"https://vale.rocks\">Normal internal link</a>. <a href=\"https://vale.rocks\"><code>Code internal link</code></a>. <a href=\"https://vale.rocks\"><del><strong><em>Bold italic strikethrough subscript internal link<sub>sub</sub></em></strong></del></a>. <a href=\"https://vale.rocks\"><del><strong><em>Bold italic strikethrough superscript external link<sup>sup</sup></em></strong></del></a>.</p>\n<p><a href=\"#main\">Anchor link</a>. <a href=\"#main\"><code>Code anchor link</code></a>. <a href=\"#main\"><del><strong><em>Bold italic strikethrough subscript anchor link<sub>sub</sub></em></strong></del></a>. <a href=\"#main\"><del><strong><em>Bold italic strikethrough superscript external link<sup>sup</sup></em></strong></del></a>.</p>\n<p><a href=\"https://zombo.com\">External link</a>. <a href=\"https://zombo.com\"><code>Code external link</code></a>. <a href=\"https://zombo.com\"><del><strong><em>Bold italic strikethrough subscript external link<sub>sub</sub></em></strong></del></a>. <a href=\"https://zombo.com\"><del><strong><em>Bold italic strikethrough superscript external link<sup>sup</sup></em></strong></del></a>.</p>\n<p>Here is an abbreviation with a link: <a href=\"https://vale.rocks\"><abbr title=\"Abreviation Meaning\">AM</abbr></a>.</p>\n<h4 id=\"quick-links\"><strong>Quick Links</strong></h4>\n<p>(Links specified with <code>&lt;&gt;</code>) <br><a href=\"https://vale.rocks\">https://vale.rocks</a> <br><a href=\"mailto:example@example.com\">example@example.com</a></p>\n<h3 id=\"lists\">Lists</h3>\n<p><strong>Unordered List</strong></p>\n<ul>\n<li>Item one<ul>\n<li>Item one&#8217;s child<ul>\n<li>Item one&#8217;s child&#8217;s child<ul>\n<li>Item one&#8217;s child&#8217;s child&#8217;s child</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Item two</li>\n<li>Item three</li>\n</ul>\n<p><strong>Ordered List</strong></p>\n<ol>\n<li>Item one<ol>\n<li>Item one&#8217;s child<ol>\n<li>Item one&#8217;s child&#8217;s child</li>\n<li>Item one&#8217;s child&#8217;s child&#8217;s sibling<ol>\n<li>Item one&#8217;s child&#8217;s child&#8217;s sibling&#8217;s child</li>\n</ol>\n</li>\n</ol>\n</li>\n</ol>\n</li>\n<li>Item two</li>\n<li>Item three</li>\n</ol>\n<p><strong>Task List</strong></p>\n<ul>\n<li><input checked=\"\" disabled=\"\" type=\"checkbox\"> Completed task</li>\n<li><input disabled=\"\" type=\"checkbox\"> Task left to do</li>\n</ul>\n<h2 id=\"blockquotes\">Blockquotes</h2>\n<blockquote>\n<p>Normal text. <em>Italic text.</em> <strong>Bold text.</strong> <strong><em>Bold italic text.</em></strong> <del>Strikethrough text.</del> <del><em>Italic strikethrough text.</em></del> <del><strong>Bold strikethrough text.</strong></del> <del><strong><em>Bold italic strikethrough text.</em></strong></del> <code>Code text.</code> <em><code>Code italic text.</code></em> <strong><code>Code bold text.</code></strong> <strong><em><code>Code bold italic text.</code></em></strong> <del><code>Code strikethrough text.</code></del> <del><strong><em><code>Code bold italic strikethrough text.</code></em></strong></del></p>\n<p>Id deleniti eveniet non placeat quia libero. Non soluta consequatur sit accusamus illum veniam. Animi ab ab omnis iusto aut. Porro tempora fugit placeat perspiciatis et rem consectetur sequi.</p>\n</blockquote>\n<blockquote>\n<p>Normal text. <em>Italic text.</em> <strong>Bold text.</strong> <strong><em>Bold italic text.</em></strong> <del>Strikethrough text.</del> <del><em>Italic strikethrough text.</em></del> <del><strong>Bold strikethrough text.</strong></del> <del><strong><em>Bold italic strikethrough text.</em></strong></del> <code>Code text.</code> <em><code>Code italic text.</code></em> <strong><code>Code bold text.</code></strong> <strong><em><code>Code bold italic text.</code></em></strong> <del><code>Code strikethrough text.</code></del> <del><strong><em><code>Code bold italic strikethrough text.</code></em></strong></del></p>\n<p>Id deleniti eveniet non placeat quia libero. Non soluta consequatur sit accusamus illum veniam. Animi ab ab omnis iusto aut. Porro tempora fugit placeat perspiciatis et rem consectetur sequi.</p>\n<blockquote>\n<p>Normal text. <em>Italic text.</em> <strong>Bold text.</strong> <strong><em>Bold italic text.</em></strong> <del>Strikethrough text.</del> <del><em>Italic strikethrough text.</em></del> <del><strong>Bold strikethrough text.</strong></del> <del><strong><em>Bold italic strikethrough text.</em></strong></del> <code>Code text.</code> <em><code>Code italic text.</code></em> <strong><code>Code bold text.</code></strong> <strong><em><code>Code bold italic text.</code></em></strong> <del><code>Code strikethrough text.</code></del> <del><strong><em><code>Code bold italic strikethrough text.</code></em></strong></del></p>\n<p>Id deleniti eveniet non placeat quia libero. Non soluta consequatur sit accusamus illum veniam. Animi ab ab omnis iusto aut. Porro tempora fugit placeat perspiciatis et rem consectetur sequi.</p>\n<blockquote>\n<p>Normal text. <em>Italic text.</em> <strong>Bold text.</strong> <strong><em>Bold italic text.</em></strong> <del>Strikethrough text.</del> <del><em>Italic strikethrough text.</em></del> <del><strong>Bold strikethrough text.</strong></del> <del><strong><em>Bold italic strikethrough text.</em></strong></del> <code>Code text.</code> <em><code>Code italic text.</code></em> <strong><code>Code bold text.</code></strong> <strong><em><code>Code bold italic text.</code></em></strong> <del><code>Code strikethrough text.</code></del> <del><strong><em><code>Code bold italic strikethrough text.</code></em></strong></del></p>\n<p>Id deleniti eveniet non placeat quia libero. Non soluta consequatur sit accusamus illum veniam. Animi ab ab omnis iusto aut. Porro tempora fugit placeat perspiciatis et rem consectetur sequi.</p>\n</blockquote>\n</blockquote>\n</blockquote>\n<h2 id=\"tables\">Tables</h2>\n<figure>\n<div class=\"table-wrapper\">\n\n<table>\n<thead>\n<tr>\n<th><strong>Vehicle Name</strong></th>\n<th><strong>Primary Users</strong></th>\n<th><strong>Vehicle Type</strong></th>\n<th><strong>Key Features</strong></th>\n<th><strong>Special Functions</strong></th>\n</tr>\n</thead>\n<tbody><tr>\n<td><strong>Thunderbird 1</strong></td>\n<td>Scott Tracy</td>\n<td>Rocket-Powered VTOL Jet</td>\n<td>Sleek design, vertical take-off and landing (VTOL)</td>\n<td>High-speed, rescue operations, aerial manoeuvrability</td>\n</tr>\n<tr>\n<td><strong>Thunderbird 2</strong></td>\n<td>Virgil Tracy</td>\n<td>Transport Aircraft</td>\n<td>Large cargo hold, modular design, green color</td>\n<td>Carries vehicles for land and sea rescues</td>\n</tr>\n<tr>\n<td><strong>Thunderbird 3</strong></td>\n<td>Alan Tracy</td>\n<td>Space Rocket</td>\n<td>Red design, space travel capabilities</td>\n<td>Space missions, long-range travel</td>\n</tr>\n<tr>\n<td><strong>Thunderbird 4</strong></td>\n<td>Gordon Tracy</td>\n<td>Submarine</td>\n<td>Yellow, compact, built for underwater exploration</td>\n<td>Submarine for underwater rescue and exploration</td>\n</tr>\n<tr>\n<td><strong>Thunderbird 5</strong></td>\n<td>John Tracy</td>\n<td>Space Station</td>\n<td>Satellite orbiting Earth, advanced communication</td>\n<td>Monitoring global distress signals from space</td>\n</tr>\n</tbody></table>\n</div>\n\n<figcaption>Table presenting the various Thunderbirds vehicles.</figcaption>\n</figure>\n\n<h2 id=\"calloutsalerts\">Callouts/Alerts</h2>\n<blockquote>\n<p>[!NOTE]\nImportant info users should be aware of, even when skimming.</p>\n</blockquote>\n<blockquote>\n<p>[!TIP]\nPractical advice for improving or simplifying tasks.</p>\n</blockquote>\n<blockquote>\n<p>[!IMPORTANT]\nCritical info for achieving the desired outcome.</p>\n</blockquote>\n<blockquote>\n<p>[!WARNING]\nUrgent info requiring immediate attention to prevent issues.</p>\n</blockquote>\n<blockquote>\n<p>[!CAUTION]\nAlerts about potential risks or negative consequences.</p>\n</blockquote>\n<h2 id=\"codeblocks\">Codeblocks</h2>\n<pre><code class=\"hljs language-css\"><span class=\"hljs-comment\">/*This is a comment in a CSS codeblock*/</span>\n\n<span class=\"hljs-selector-class\">.line</span> {\n\t<span class=\"hljs-attribute\">display</span>: inline-block;\n\t<span class=\"hljs-attribute\">width</span>: <span class=\"hljs-number\">100%</span>;\n\t<span class=\"hljs-attribute\">background</span>: inherit;\n}\n</code></pre><h2 id=\"endside-notes\">End/Side Notes</h2>\n<p>There is a note after this [^1].</p>\n<p>Here is a lot of them, to see if they break&#8230; [^2] [^3] [^4] [^5] [^6] [^7] [^8].</p>\n<h2 id=\"definitions\">Definitions</h2>\n<p>Frood\n: Someone who is really amazingly together.</p>\n<p>Defenestration\n: The act of throwing someone or some thing out of a window.</p>\n<p>Schlock\n: Something that is low-quality, junky, or tacky.</p>\n<h2 id=\"figures\">Figures</h2>\n<p>Standard image not in a figure:\n<img src=\"/assets/posts/i-got-a-flipper-zero/flipper-zero-on-table.avif\" alt=\"A picture of a Flipper Zero sitting on a table.\"></p>\n<figure class=\"right\">\n<img src=\"/assets/posts/i-got-a-flipper-zero/flipper-zero-on-table.avif\" alt=\"A picture of a Flipper Zero sitting on a table.\" />\n<figcaption>Right floated figure with caption.</figcaption>\n</figure>\n\n<figure class=\"left\">\n<img src=\"/assets/posts/i-got-a-flipper-zero/flipper-zero-on-table.avif\" alt=\"A picture of a Flipper Zero sitting on a table.\" />\n<figcaption>Left floated figure with caption.</figcaption>\n</figure>\n\n<p>Some placeholder text for presenting figure placements. Nihil totam accusantium voluptas sit ipsa est non vero. Aut occaecati fuga consequatur. Voluptatem ratione itaque dolorum. Laudantium commodi ratione recusandae autem. Nihil necessitatibus nobis sint.</p>\n<p>Voluptatibus sunt voluptas sequi est sit rem. Molestiae veniam dolores sequi aut vitae dolores officiis. Ad enim facere non ullam sequi placeat aliquam et. Et voluptas praesentium doloribus saepe quibusdam omnis consectetur. Provident non architecto quisquam libero explicabo.</p>\n<p>Eligendi harum fugit aut accusamus rerum illum ad quae. Ratione similique iste nostrum magni. Dolor tempore ipsum ullam. Repellat voluptatem voluptatem quia ducimus animi. Doloremque quisquam ut expedita sed.</p>\n<p>Soluta inventore est quia ipsum doloribus repellat doloremque. Ratione aut enim deserunt quibusdam. Dolorem architecto maiores pariatur iure maxime illum. Nihil id aut fuga.</p>\n<p>Magni pariatur qui molestias. Nemo voluptatem distinctio voluptate voluptate vitae odio nemo. Praesentium omnis beatae mollitia dolore quasi delectus. Non hic non natus.</p>\n<p>Voluptatibus sunt voluptas sequi est sit rem. Molestiae veniam dolores sequi aut vitae dolores officiis. Ad enim facere non ullam sequi placeat aliquam et. Et voluptas praesentium doloribus saepe quibusdam omnis consectetur. Provident non architecto quisquam libero explicabo.</p>\n<h2 id=\"colour-palette\">Colour Palette</h2>\n<style>\n.colour-blocks {\n    display: flex;\n    flex-wrap: wrap;\n    gap: 0.5rem;\n\n    > span {\n        display: inline-block;\n        width: 5rem;\n        height: 5rem;\n        border: var(&#8211;white) solid 2px;\n        padding: 0.25rem;\n    }\n}\n</style>\n\n<div class=\"colour-blocks\">\n<span style=\"background: var(--black);\">Black</span>\n<span style=\"background: var(--dark_grey);\">Dark Grey</span>\n<span style=\"background: var(--grey);\">Grey</span>\n<span style=\"background: var(--bright_grey);\">Bright Grey</span>\n<span style=\"background: var(--white);\">White</span>\n<span style=\"background: var(--bright_white);\">Bright White</span>\n<span style=\"background: var(--red);\">Red</span>\n<span style=\"background: var(--bright_red);\">Bright Red</span>\n<span style=\"background: var(--orange);\">Orange</span>\n<span style=\"background: var(--bright_orange);\">Bright Orange</span>\n<span style=\"background: var(--yellow);\">Yellow</span>\n<span style=\"background: var(--bright_yellow);\">Bright Yellow</span>\n<span style=\"background: var(--green);\">Green</span>\n<span style=\"background: var(--bright_green);\">Bright Green</span>\n<span style=\"background: var(--blue);\">Bright Blue</span>\n<span style=\"background: var(--cyan);\">Cyan</span>\n<span style=\"background: var(--bright_cyan);\">Bright Cyan</span>\n<span style=\"background: var(--magenta);\">Magenta</span>\n<span style=\"background: var(--bright_magenta);\">Bright Magenta</span>\n</div>\n\n<p><span style=\"color: var(--black);\">Black</span>\n<span style=\"color: var(--dark_grey);\">Dark Grey</span>\n<span style=\"color: var(--grey);\">Grey</span>\n<span style=\"color: var(--bright_grey);\">Bright Grey</span>\n<span style=\"color: var(--white);\">White</span>\n<span style=\"color: var(--bright_white);\">Bright White</span>\n<span style=\"color: var(--red);\">Red</span>\n<span style=\"color: var(--bright_red);\">Bright Red</span>\n<span style=\"color: var(--orange);\">Orange</span>\n<span style=\"color: var(--bright_orange);\">Bright Orange</span>\n<span style=\"color: var(--yellow);\">Yellow</span>\n<span style=\"color: var(--bright_yellow);\">Bright Yellow</span>\n<span style=\"color: var(--green);\">Green</span>\n<span style=\"color: var(--bright_green);\">Bright Green</span>\n<span style=\"color: var(--blue);\">Bright Blue</span>\n<span style=\"color: var(--cyan);\">Cyan</span>\n<span style=\"color: var(--bright_cyan);\">Bright Cyan</span>\n<span style=\"color: var(--magenta);\">Magenta</span>\n<span style=\"color: var(--bright_magenta);\">Bright Magenta</span></p>\n<h2 id=\"horizontal-rule\">Horizontal Rule</h2>\n<p>And finally, a nice horizontal rule&#8230;</p>\n<hr>\n<!-- Sneaky little comment that won't be rendered. -->\n\n<h2 id=\"footnotes\">Footnotes</h2>\n<p>[^1]: This is a footnote, but more accurately it&#8217;s an endnote, and it&#8217;ll appear as a sidenote on larger screens.\n[^2]: Magni dolorum ipsa voluptas tempore est ut in. Dicta corrupti ipsa aspernatur. Soluta sunt quae impedit. Eos nobis accusantium ut amet.\n[^3]: Id ex ipsum rerum tempore. Sunt ab deserunt impedit architecto reprehenderit ex. Corporis dolores qui accusamus dolorem. Laudantium optio voluptatem eum id qui. Est ut laborum unde.\n[^4]: Dolor expedita repudiandae voluptas. Veritatis beatae quis impedit id veniam. Nisi illum animi voluptatem magnam labore sunt omnis.\n[^5]: Est illo fuga autem fugiat qui quaerat inventore. Suscipit in aut vero libero labore ut. Facere enim nihil itaque. Enim aut dignissimos non velit autem odio quae. Libero et corrupti eos.\n[^6]: Similique laboriosam quas ipsam molestias quia. Earum maxime quo veniam modi. Exercitationem et odit cum. Aspernatur et ad dolor voluptatem aperiam nihil et ut.\n[^7]: Cum eligendi quaerat blanditiis. Nostrum distinctio vel veritatis ut quod vel ea ipsa. Doloribus quae quia quibusdam veritatis provident reiciendis reiciendis quisquam.\n[^8]: Eaque perferendis eos illo. Cum quos qui aut commodi. Et cumque quaerat molestiae. Quo laboriosam itaque odit dolorem perferendis eius.</p>\n",
      "date_published": "2024-11-25",
      "id": "https://vale.rocks/posts/lorem-ipsum.html",
      "title": "Lorem Ipsum",
      "url": "https://vale.rocks/posts/lorem-ipsum.html"
    },
    {
      "content_html": "<p>I&#8217;m not quiet about my intense distaste for Microsoft&#8217;s feeble attempt at an operating system. I find Windows to be a horrific amalgamation of legacy code, bloat, and hostile user practices that I avoid when possible. Unfortunately, it&#8217;s not always possible to do so.</p>\n<p>This year, I found myself doing a Certificate IV in Graphic Design that required Adobe&#8217;s Creative Cloud. As I&#8217;m sure you know, this software only runs on MacOS and Windows, which lead to quite the conundrum. Not willing to give up my beloved Arch Linux, I needed a way to get these programs running on my computer.</p>\n<p>Dual booting was an option, but one with hassle, so I chose to fire up a Windows virtual machine with a few tweaks. I ran the virtual machine with KVM/QEMU using Virt-Man but that isn&#8217;t the focus of this article. This article is about the tweaks I used and how I made Windows vaguely usable. With any luck, you can achieve the same.</p>\n<h2 id=\"installation\">Installation</h2>\n<p>While it may seem sensible to just jump straight into installation, there is a much better way to do it. You&#8217;ll first need to <a href=\"https://www.microsoft.com/software-download/windows11\">grab an ISO from Microsoft&#8217;s website</a>. If you are wondering why I recommend Windows 11 over 10, it&#8217;s for a few reasons. I find 11 to be a bit more visually appealing, and it also gets more focus from Microsoft, giving it newer features, and making it more secure. Most of the issues that people blabber on about can be easily fixed with a few under the hood changes anyway.</p>\n<blockquote>\n<p>[!WARNING]\nI recommend using a stock ISO from Microsoft rather than mods such as Tiny11. Their stripped back nature often leads to the breakage of certain features or incompatibility with programs. The closed source nature of most ISOs also leads to the potential for bundled malware. There are many ways to debloat Windows without causing undue harm that will be detailed further along in this article.</p>\n</blockquote>\n<p>Writing the ISO once you&#8217;ve got it is pretty easy. If you have a Windows install on hand that you can use to create the installation media, then I recommend writing the ISO with <a href=\"https://rufus.ie\">Rufus</a>. If using another OS to write the media, then use whatever you&#8217;re most used to.</p>\n<p>Once you&#8217;ve booted to the installer, I recommend setting the &#8216;Time and Currency Format&#8217; to &#8216;English (World)&#8217;. This will stop Windows from installing all of its default bloat, but will also break the Microsoft Store. Don&#8217;t fret if you like the Microsoft Store, as this guide will tell you how to reenable it later. I then suggest selecting &#8216;Windows 11 Pro&#8217; for the version.</p>\n<p>Once you&#8217;ve entered the Out of Box Experience (OOBE), there may be a decently long loading screen before you are greeted by a region error. Click &#8216;skip&#8217; and then continue as you usually would.</p>\n<p>When it asks how you would like the device setup, select &#8216;Set up for Work or School&#8217;. On the following screen, select &#8216;Sign-in options&#8217; and then &#8216;Domain join instead&#8217; which will allow you to create an offline account. Then continue on with setup and disable any telemetry toggles as you go. Once finished, your computer will boot into the desktop.</p>\n<p>If you want to use the Microsoft Store, then you will need to change your region. This can be done by opening settings and navigating to &#8216;Time & language > Language & region&#8217;. Set the &#8216;Country or Region&#8217; to your own.</p>\n<h2 id=\"configuration\">Configuration</h2>\n<p>In my opinion, Microsoft made some truly baffling decisions in Windows 11, so I&#8217;ll run you through how to unbaffle your install with a couple of handy tools. After all, nothing says &#8216;user-friendly&#8217; like needing a Swiss army knife to push a button.</p>\n<p>The first thing to do is figure out how you want to install applications. Most people will simply search the web for executables to install, but that is a rather insecure way to go about it. It&#8217;s all too easy to click the wrong link and end up with a trojan. For that reason, I recommend using a command line tool such as <a href=\"https://scoop.sh\">Scoop</a> or <a href=\"https://chocolatey.org\">Chocolatey</a>, especially if you&#8217;re coming from Linux. Otherwise, you can use the Microsoft Store (if you reenabled it above) or just take the risk of downloading installers from the web.</p>\n<p>The second thing that I recommend fixing is the start menu. For this, I chose <a href=\"https://github.com/valinet/ExplorerPatcher/wiki\">ExplorerPatcher</a> which brings back Windows 10&#8217;s start menu with added customisability and adds the ability to change flyouts and other such things. It&#8217;s very good.</p>\n<p>I also recommend installing using <a href=\"https://github.com/microsoft/PowerToys\">Microsoft&#8217;s PowerToys</a>. The full functionality is outside the scope of this article, but I use it to set my keyboard layout, rename files, organise my window layouts, resize images, and highlight my cursor for demonstrations.</p>\n<p>If you are a developer, then you can&#8217;t go wrong with <a href=\"https://devtoys.app\">DevToys</a> which is an excellent little tool that you will constantly find yourself using. When developing, it can also prove useful to add things to the File Explorer context menu. <a href=\"https://nilesoft.org\">Shell</a> is a very good tool that does just that.</p>\n<p>It is also useful to have a good terminal on hand. Microsoft&#8217;s <a href=\"https://github.com/microsoft/terminal\">Windows Terminal</a> is surprisingly good for what it is. It combines Powershell and Command Prompt, along with any Windows Subsystem for Linux compatibility layers you may have, into a cohesive, modern, and sleek interface. It&#8217;s a genuinely good terminal, something I didn&#8217;t expect from Microsoft when I first heard of it.</p>\n<p>If you are sick of Windows&#8217; bloat, then you can try a debloater script such as <a href=\"https://github.com/LeDragoX/Win-Debloat-Tools\">Win Debloat Tools</a>. Keep in mind debloat scripts can also cause harm by removing dependencies of other programs, so I recommend proceeding with the utmost caution.</p>\n<p>A few other assorted tools and programs that work on Windows and that I can recommend include:</p>\n<ul>\n<li><a href=\"https://github.com/M2Team/NanaZip\">NanaZip</a> - a decent archive manager based on 7-Zip.</li>\n<li><a href=\"https://www.mozilla.org/en-US/firefox/browsers\">Firefox</a> - an excellent browser.</li>\n<li><a href=\"https://www.videolan.org/vlc\">VLC</a> - a FOSS media player that plays just about anything.</li>\n<li><a href=\"https://www.thunderbird.net\">Thunderbird</a> - a very nice email client.</li>\n<li><a href=\"https://www.libreoffice.org\">LibreOffice</a> - an excellent office suite. Check out <a href=\"/posts/the-ultimate-libreoffice-setup\">my guide on improving it</a>.</li>\n</ul>\n<p>Now that you have your system more or less configured, I thought it may be worth touching on antivirus programs. There are plenty out there, and each is as user hostile as the last. For that reason, I recommend sticking with Windows&#8217; built in Microsoft Defender. It is pretty fast, generally stays out of your way, and won&#8217;t harass you for your lunch money. It may be lacking in some features compared to paid options, but it is widely used and very well supported. It&#8217;s just about the best option around.</p>\n<hr>\n<p>And there you have it, a few tweaks, and Windows went from &#8216;Why do you insist on torturing me?&#8217; to &#8216;I suppose you can stay&#8217;. I hope you found this little guide useful. Is there anything specific you do for your installs or something that I missed? If so, leave it in the comments!</p>\n",
      "date_published": "2023-10-31",
      "id": "https://vale.rocks/posts/making-windows-usable.html",
      "title": "Making Windows \"Usable\"",
      "url": "https://vale.rocks/posts/making-windows-usable.html"
    },
    {
      "content_html": "<p>The first iteration of this article was written in a hotel room on a rainy Monday, overlooking Melbourne. It went live on April 2nd, 2024 &#8211; the day of my 18th birthday. I had a lot running through my mind, including the new responsibilities and freedoms that come with being an adult.</p>\n<p>I could bloat the word count of this article dwelling on the encroaching responsibilities of adulthood or reminiscing about the &#8216;end&#8217; of my childhood. I could even lament the gum stuck to my shoe that I keep forgetting to scrape off. But I want to write about a game that sits with me: Minecraft.</p>\n<p>Like many my age, I grew up alongside Minecraft. I first discovered it via YouTube circa ~2012 [^1]. Initially through my parent&#8217;s iPad 3, and later through my own iPad 4. I remember waking up before school to watch the comedic duo of <a href=\"https://www.youtube.com/@stampycat\">StampyLongHead</a> and <a href=\"https://www.youtube.com/@iBallisticSquid\">iBallisticSquid</a> in their latest let&#8217;s plays bumbling through various adventure maps and duking it out in Hunger Games. I remember watching their individual series, such as Squid&#8217;s <a href=\"https://www.youtube.com/playlist?list=PL87AFDeJs846nDRNH2bTddRV2Gh63Kkgp\">Sky Island Challenge</a> or Stampy&#8217;s <a href=\"https://www.youtube.com/playlist?list=PLEZiAg2bYC7ngh-_Z_ruvzSfn1KPQRL5V\">Lovely World</a>.</p>\n<p>It was a carefree time where my responsibilities were nil and time wasn&#8217;t a luxury.</p>\n<h2 id=\"pocket-edition\">Pocket Edition</h2>\n<p>I first got hands-on with the game via Minecraft Pocket Edition Lite, a cut-down version of the game designed as a demo. I played it for hours. It was limited and lacked much of anything. It had a limited block palette and an even more limited world. It wasn&#8217;t much, but it was Minecraft, and, to me at the time, that was a lot.</p>\n<figure class=\"right\">\n<img src=\"https://minecraft.wiki/images/thumb/Pocket_Edition_v0.2.1_alpha2_%28Demo%29.png/600px-Pocket_Edition_v0.2.1_alpha2_%28Demo%29.png\" alt=\"Simple menu featuring 3 options.\" />\n<figcaption>Main menu of Minecraft PE Lite.</figcaption>\n</figure>\n\n<p>In 2013, I bought Pocket Edition for my iPad. I still remember being out the front of my house when my mother, whom I had been nagging to let me buy it, finally said yes.</p>\n<p>The game was very limited at the time, but it was Minecraft. I built garish houses of diamonds and gold, laid out intricate patterns of TNT just to watch them explode, and tested just how much of a superflat world I could fill with lava.</p>\n<p>I remember the big update when potions released and splashing them everywhere just to see the particle effects. I remember horses being added and having to consult YouTube to find out how to tame them. I recall end portal frames appearing in the creative menu and not knowing how to use them. I remember messing around with the <a href=\"https://minecraft.wiki/w/Nether_Reactor_Core\">Nether Reactor Core</a> before the Nether was released. I remember freaking out about weird world generation thinking that Herobrine had paid me a visit.</p>\n<p>Pocket Edition grew around me and was the version I played the most. However, I could never shake the feeling that it was inferior. It didn&#8217;t have parity with the other versions, I couldn&#8217;t play on the big name servers, and touchscreen simply isn&#8217;t a great input method. Playing it made me feel like a second-class citizen. Everyone else played the bigger, better versions, and for the longest time, I only got to experience them through trips to friends&#8217; houses and YouTube.</p>\n<p>Sure, the game did evolve with updates and some simple servers eventually launched, but it was largely inferior to the other versions even after trying to improve the experience with things like <a href=\"http://plugpe.github.io\">Plug for Minecraft PE</a>.</p>\n<p>Our household computers were aging and barely equipped to run Windows, let alone the Java Edition, but my family owned a few consoles, and it wasn&#8217;t with the Pocket or Java Editions that I had originally fallen in love with the game anyway. My journey truly began with the versions featured in the YouTube videos I avidly watched: the Legacy Console Editions, starting with the Xbox 360 Edition.</p>\n<h2 id=\"legacy-console-editions\">Legacy Console Editions</h2>\n<p>In 2012, 4J Studios released Minecraft: Xbox 360 Edition. 4J didn&#8217;t just settle with a direct port of the game. They went further. They improved it. They crafted an experience that did more than just mimicking the flagship Java edition by improving upon it with quality of life improvements and changes that adapted it to the controller experience.</p>\n<figure class=\"right\">\n<img src=\"https://minecraft.wiki/images/Retail_SplashScreen.png\" alt=\"Splash screen featuring a sandstone castle built in Minecraft with several players standing on it.\" />\n<figcaption>TU9 splash screen for Minecraft: Xbox 360 Edition.</figcaption>\n</figure>\n\n<p>The first thing that appears in my mind when I think of the Legacy Console Editions of Minecraft (or Minecraft as a whole for that matter) is the tutorial world. The tutorial world served as a way to introduce the player to the mechanics of the game. Something no other version does. It was beautifully crafted and let the player explore and learn at their own pace.</p>\n<p>The tutorial world Minecraft expanded alongside the game itself, evolving gradually over the years to become more extensive and immersive. Redesigned multiple times, it even included nods to the community, such as snippets of Stampy&#8217;s Lovely World.</p>\n<p>There were also many smaller alterations, such as minecarts moving at twice their Java Edition speed, leading to them being far more practical. Plus, an exclusive song titled &#8216;Dog&#8217; playing following the completion of the &#8216;Cat&#8217; music disc.</p>\n<figure class=\"right\">\n<img src=\"https://minecraft.wiki/images/Crafting_Table_LCE.png\" alt=\"Screenshot of the crafting table menu.\" />\n<figcaption>Legacy Console Edition Crafting Interface.</figcaption>\n</figure>\n\n<p>They also completely redesigned the user interface for controller. I find myself blindly fumbling through the UI of the modern Bedrock Edition, but can smoothly glide through Legacy Console&#8217;s UI with ease. The crafting UI specifically is one of the best controller oriented user experiences I&#8217;ve ever had, although the option to use the standard crafting grid from the desktop experience was left available for players who preferred it.</p>\n<p>Legacy Console also featured an excellent set of customisation options for superflat worlds. You could choose the blocks layer by layer and specify exactly what structures should generate. The customisation was so excellent that it spawned countless challenges. Even now, years later, no other edition has superflat customisation to this level.</p>\n<p>Another thing that speaks to 4J&#8217;s commitment is their implementation of the minigame modes. Exclusive to the Legacy Console Editions are Battle, Tumble, and Glide. Battle is Hunger Games, Tumble is spleef, and Glide is an Elytra race. Each of these modes were well fleshed out and polished with a custom UI. The lobby for the mini games was also intricate and played host to a range of Easter eggs.</p>\n<p>The game was also optimised to an impressive degree. Looking back, it&#8217;s easy to forget just how limited the seventh generation of consoles were. The Xbox 360 had a meagre 512 MB of RAM. Yes, there were limitations. There was a cap on mobs, and the worlds weren&#8217;t infinite, but most of what defined Minecraft was there, and the limitations were more than made up for by the numerous tweaks 4J introduced.</p>\n<p>While the legacy editions were remarkable, they&#8217;re nothing without the experiences I associate with them. I&#8217;ve got excellent memories of going round to my friend&#8217;s house and fighting him head to head in the various minigame modes on his PS3. I also cherish playing worlds built by my cousin.</p>\n<p>Some of his most memorable included a labyrinthine adventure map infested with spiders and an excellent PvP tower defence map. The latter comprised of a set of two castles built entirely out of gold blocks, suspended high over lava with only a precarious bridge connecting them. Both castles were adorned with chests full of enchanted weaponry and TNT cannons prone to self-destruction.</p>\n<p>Yet over time, I found myself playing with others less and less. Minecraft fell out of favour, and other games grew in relevance. I stopped watching many of my favourite Minecraft creators. They stopped uploading. I drifted apart from the game. Time moved on. I moved on. I grew up.</p>\n<p>The Legacy Console editions are all unsupported now. The PS3 and Vita Editions were the last to go, with both receiving a last update on April 15, 2020. The 360 Edition got its last update on April 30, 2019 with TU75.</p>\n<blockquote>\n<p>[!NOTE]\nThe Xbox One Edition received an unexpected update, CU59, on April 9, 2024 &#8211; over 4 years after its last one. You can <a href=\"https://minecraft.wiki/w/Xbox_One_Edition_CU59\">view the update page on the Minecraft Wiki</a> for more information.</p>\n</blockquote>\n<h2 id=\"growing-up\">Growing Up</h2>\n<p>Eventually, I bought the Java Edition. I joined the big servers and played with friends, but the spark wasn&#8217;t there. Big servers felt corporate and bland, and multiplayer servers with friends failed to evoke the emotion I associate with the game. I attempted to start a single-player world but found myself abandoning worlds after just a few days.</p>\n<p>I loved Minecraft then, and I love it now. Putting on C418&#8217;s soundtrack evokes a unique sense of melancholy that nothing else can rival. Occasionally, I still find myself watching the old YouTube videos that first pulled me into the game, just for that hit of nostalgia.</p>\n<p>I realise now that I wasn&#8217;t merely playing a game and manipulating pixels on a screen; I was forging memories &#8211; memories that, years later, I still hold dear.</p>\n<p>Two quotes come to mind thinking about the game:</p>\n<blockquote>\n<p>“Don’t cry because it’s over. Smile because it happened.” <br><em>- Dr Seuss</em></p>\n</blockquote>\n<blockquote>\n<p>“How lucky I am to have something that makes saying goodbye so hard.” <br><em>- A A Milne</em></p>\n</blockquote>\n<p>Thank you.</p>\n<h2 id=\"footnotes\">Footnotes</h2>\n<p>[^1]: This year is an approximation thanks to how long ago it was and my lack of personal logging during that period. It is also entirely possible I was exposed to Minecraft via alternate means prior to discovering it on YouTube, but I have no memory of that.</p>\n",
      "date_published": "2024-04-02",
      "id": "https://vale.rocks/posts/minecraft-nostalgia-and-growing-up.html",
      "title": "Minecraft, Nostalgia, and Growing Up",
      "url": "https://vale.rocks/posts/minecraft-nostalgia-and-growing-up.html"
    },
    {
      "content_html": "<p>Software development is a varied field with varied opinions regarding varied ways of doing varied things. Everyone has their own opinionated takes on how code should be formatted. This leads to what can best be described as a conflated mess of conflicting thought. This is <em>not</em> something I, nor anyone else, ever want to deal with.</p>\n<p>This is why we have code style guidelines. These guidelines outline how to format things so that everyone gets along and manslaughter is kept to a minimum. I myself have my own opinionated takes on how code should be formatted and find myself repeating the justification of my choices, so I&#8217;ve documented them here.</p>\n<p>Worth noting is that I am a frontend developer, and that is reflected in my preferences and the technologies those preferences best apply to. I tend to build for the web using HTML, CSS, and JavaScript where possible, but often find myself working with more complex stacks incorporating languages such as PHP and TypeScript and a smattering of frameworks.</p>\n<p>I personally enforce these settings using <a href=\"https://prettier.io\">Prettier</a>, which I feel does an excellent job. You can find my .prettierrc in my <a href=\"https://github.com/DeclanChidlow/dotfiles/blob/main/Baud/.prettierrc.yaml\">dotfile repo on GitHub</a>. I&#8217;ve also noted the relevant Prettier options where applicable.</p>\n<h2 id=\"use-tabs\">Use Tabs</h2>\n<p>Tabs should be used for indentation for several reasons. These include:</p>\n<ul>\n<li>Semantic indication of indentation</li>\n<li>Customisable display</li>\n<li>Improved accessibility</li>\n<li>Smaller file sizes</li>\n</ul>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#tabs\"><code>useTabs: true</code></a></p>\n<h2 id=\"always-add-semicolons\">Always Add Semicolons</h2>\n<p>When writing JavaScript, every line that can end with a semicolon should end with a semicolon. JavaScript engines add them anyway, and it&#8217;s ideal to see exactly what code will be executed.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#semicolons\"><code>semi: true</code></a></p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\n<span class=\"hljs-keyword\">function</span> name {\n\t<span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-title function_\">log</span>(<span class=\"hljs-string\">&quot;I truly do love JavaScript&quot;</span>)\n}\n\n<span class=\"hljs-comment\">// Good</span>\n<span class=\"hljs-keyword\">function</span> name {\n\t<span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-title function_\">log</span>(<span class=\"hljs-string\">&quot;I truly do love JavaScript&quot;</span>);\n}\n</code></pre><h2 id=\"use-double-quotes\">Use Double Quotes</h2>\n<p>Strings should use double quotes (<code>&quot;&quot;</code>), not single quotes (<code>&#39;&#39;</code>). This makes it easier to use single quotes (which are more common) within strings. This is merely a default, and there will be situations where using single quotes is preferable. For the most part, Prettier will handle these exceptions.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#quotes\"><code>singleQuote: true</code></a>, <a href=\"https://prettier.io/docs/en/options.html#jsx-quotes\"><code>jsxSingleQuote: false</code></a></p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\n<span class=\"hljs-keyword\">const</span> variable = <span class=\"hljs-string\">&#x27;String Content&#x27;</span>;\n\n<span class=\"hljs-comment\">// Good</span>\n<span class=\"hljs-keyword\">const</span> variable = <span class=\"hljs-string\">&quot;String Content&quot;</span>;\n</code></pre><h2 id=\"quote-properties\">Quote Properties</h2>\n<p>Properties should all be quoted in the same way, rather than introducing unnecessary (and potentially confusing) variation within an object.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#quote-props\"><code>quoteProps: &quot;consistent&quot;</code></a></p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\nobject = {\n\t<span class=\"hljs-attr\">property1</span>: <span class=\"hljs-string\">&quot;content&quot;</span>,\n\t<span class=\"hljs-string\">&quot;property2&quot;</span>: <span class=\"hljs-string\">&quot;content&quot;</span>\n};\n\n<span class=\"hljs-comment\">// Good</span>\nobject = {\n\t<span class=\"hljs-string\">&quot;property1&quot;</span>: <span class=\"hljs-string\">&quot;content&quot;</span>,\n\t<span class=\"hljs-string\">&quot;property2&quot;</span>: <span class=\"hljs-string\">&quot;content&quot;</span>\n};\n</code></pre><h2 id=\"dont-split-strings-across-multiple-lines\">Don&#8217;t Split Strings Across Multiple Lines</h2>\n<p>Strings should be contained within one line unless there is genuine reason not to do so. It makes things hard to search and is a general pain to deal with.</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\n<span class=\"hljs-keyword\">const</span> variable = <span class=\"hljs-string\">&quot;This is awful. It may be easier for a human to read, but \\\nit leads to annoyance and makes it harder to search for things. It is an \\\nall around pain.&quot;</span>;\n\n<span class=\"hljs-comment\">// Good</span>\n<span class=\"hljs-keyword\">const</span> variable = <span class=\"hljs-string\">&quot;This is better. It may be a tad harder for a human to read, but resolves many annoyances and makes it easier to search for things. It is much cleaner as well.&quot;</span>;\n</code></pre><h2 id=\"use-trailing-commas\">Use Trailing Commas</h2>\n<p>Trailing commas help keep version history clean. Rather than a diff showing the implementation of a new line <em>and</em> a comma on the previous line, it will only display the actual change, a new line.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#trailing-commas\"><code>trailingComma: &quot;all&quot;</code></a></p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\nobject = {\n\t<span class=\"hljs-attr\">property1</span>: <span class=\"hljs-string\">&quot;content&quot;</span>,\n\t<span class=\"hljs-string\">&quot;property2&quot;</span>: <span class=\"hljs-string\">&quot;content&quot;</span>\n};\n\n<span class=\"hljs-comment\">// Good</span>\nobject = {\n\t<span class=\"hljs-string\">&quot;property1&quot;</span>: <span class=\"hljs-string\">&quot;content&quot;</span>,\n\t<span class=\"hljs-string\">&quot;property2&quot;</span>: <span class=\"hljs-string\">&quot;content&quot;</span>,\n};\n</code></pre><h2 id=\"space-brackets\">Space Brackets</h2>\n<p>Brackets should have spaces on either side to provide padding. This makes it easier to read and maintains consistency.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#bracket-spacing\"><code>bracketSpacing: true</code></a></p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\n{<span class=\"hljs-attr\">foo</span>: bar}\n\n<span class=\"hljs-comment\">// Good</span>\n{ <span class=\"hljs-attr\">foo</span>: bar }\n</code></pre><h2 id=\"use-arrow-parentheses\">Use Arrow Parentheses</h2>\n<p>Using arrow parentheses makes it easier to read and make changes.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#arrow-function-parentheses\"><code>arrowParens: always</code></a></p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-comment\">// Bad</span>\nx =&gt; x\n\n<span class=\"hljs-comment\">// Good</span>\n(x) =&gt; x\n</code></pre><h2 id=\"unwrap-prose\">Unwrap Prose</h2>\n<p>Prose formatting should be handled slightly differently to code. As such, each block of prose should be unwrapped into one line. This makes it easy for any editor to define how they want prose to display.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#prose-wrap\"><code>proseWrap: preserve</code></a></p>\n<h2 id=\"html-whitespace-sensitive-formatting\">HTML Whitespace Sensitive Formatting</h2>\n<p>Formatting HTML can be messy due to the way browsers parse whitespace. Prettier <a href=\"https://prettier.io/blog/2018/11/07/1.15.0#whitespace-sensitive-formatting\">offers a good explanation of it</a>, but the crux is that their CSS formatting option offers the best mix of human readability and preservation of whitespace.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#html-whitespace-sensitivity\"><code>htmlWhitespaceSensitivity: css</code></a></p>\n<h2 id=\"line-feed-end-of-line\">Line Feed End of Line</h2>\n<p>Different operating systems handle line endings differently, and things get messy quick. Using line feed, which is common on Unix based systems, is a clean option that is also supported on Windows.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#end-of-line\"><code>endOfLine: lf</code></a></p>\n<h2 id=\"format-embedded-languages\">Format Embedded Languages</h2>\n<p>Code of one type used within a file of another should be formatted as you would code in it&#8217;s native filetype.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#embedded-language-formatting\"><code>embeddedLanguageFormatting: auto</code></a></p>\n<h2 id=\"keep-multiple-attributes-per-line\">Keep Multiple Attributes Per Line</h2>\n<p>Splitting an element&#8217;s attributes into multiple lines often makes it harder to quickly grasp structure and is an inefficient use of screen space.</p>\n<p>Prettier: <a href=\"https://prettier.io/docs/en/options.html#single-attribute-per-line\"><code>singleAttributePerLine: false</code></a></p>\n<pre><code class=\"hljs language-html\">// Bad\n<span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">div</span>\n\t <span class=\"hljs-attr\">class</span>=<span class=\"hljs-string\">&quot;name&quot;</span>\n\t <span class=\"hljs-attr\">id</span>=<span class=\"hljs-string\">&quot;name&quot;</span>\n&gt;</span>\n\tContent\n<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">div</span>&gt;</span>\n\n// Good\n<span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">div</span> <span class=\"hljs-attr\">class</span>=<span class=\"hljs-string\">&quot;name&quot;</span> <span class=\"hljs-attr\">id</span>=<span class=\"hljs-string\">&quot;name&quot;</span>&gt;</span>\n\tContent\n<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">div</span>&gt;</span>\n</code></pre><hr>\n<p>There you have my personal guidelines. I&#8217;m sure many people disagree (if only for my preference of tabs over spaces), and I&#8217;d love to hear your thoughts in the comments. All I ask is that you keep criticism constructive and remain respectful.</p>\n<p>If you liked this post, then do consider sharing it. Also, if you&#8217;d like to support me in making more like it, consider <a href=\"/support\">sending me a tip</a>. It&#8217;d mean a lot.</p>\n",
      "date_published": "2024-04-18",
      "id": "https://vale.rocks/posts/my-code-formatting-guidelines.html",
      "title": "My Code Formatting Guidelines",
      "url": "https://vale.rocks/posts/my-code-formatting-guidelines.html"
    },
    {
      "content_html": "<p>First introduced in 2001, 3G began its adoption in Australia in 2003, marking its long standing presence in the tech landscape. However, technological advancements since then have led to a shift away from 3G in favour of 4G and 5G networks. Initially, it might seem non-alarming that plans for Australia&#8217;s 3G network disconnection were announced for as early as December, but the reality is more significant than anticipated.</p>\n<p>As it stands, 4G in Australia is conceded with data. Voice communications are left to 3G. 4G uses a standard called Voice over LTE (VoLTE) which permits higher quality transmissions as it is sent over the data network. This is all well and good, but not all devices support this standard. Most phones manufactured in 2020 and onwards support it, but even that is iffy. Many imported phones fail to adhere to the standard and instead fall back to 3G for voice communication. This means that not only will all 3G devices stop working, but also that many devices supporting 4G without VoLTE will be negatively affected.</p>\n<h2 id=\"impact-on-devices\">Impact on Devices</h2>\n<p>3G is still very much relied upon by countless devices. An instance of this is my grandfather&#8217;s pacemaker, which uses 3G to communicate and report issues such as an abnormal cardiac rhythm. While I believe the issue was rectified with my grandfather, I&#8217;m sure it is only too easy for it to manifest in a host of other medical devices, such as fall detectors, which often rely on the 3G network to send alerts.</p>\n<figure class=\"right\">\n<img src=\"https://images.unsplash.com/photo-1633997011021-0254baa23289\" alt=\"A man on a lift working on a phone tower.\" />\n</figure>\n\n<p>Australia is heavily involved in both farming and mining; both industries rely significantly on legacy equipment and, as such, legacy networking. The sort of networking that includes 3G connectivity. As such, equipment will need to be replaced or upgraded, at a cost. The impact of this on the financially robust mining industry might not be substantial, but it certainly will impact the individual, independent farmers who are already struggling.</p>\n<p>It won&#8217;t only be the farmers who are hit with unexpected costs come the shutdown. It will also affect many small businesses operating with old and outdated EFTPOS machines. Investing hundreds of dollars into new payment terminals and setup, especially amidst a cost of living crisis, may very well not be financially feasible for these smaller businesses. Moreover, it will force countless people into buying new phones, personal hotspot devices, security systems, and medical devices, straining their financial capacities.</p>\n<p>This equipment replacement doesn&#8217;t just come with a financial burden; it also comes with an ecological one. As the rollout continues and more and more devices become glorified paperweights, they will end up as e-waste. Tech devices, and especially the batteries contained within them, are notoriously hard to dispose of. A mass exodus of these devices will poison the environment for no conceivable reason and add to our existing e-waste crisis.</p>\n<h2 id=\"coverage-issues\">Coverage Issues</h2>\n<p>Many countries around the world have already disconnected with places such as Malaysia, phasing it out as early as 2021. They encountered issues with their older devices, of course, but they also ran into issues with network coverage. To carry data quickly, faster technologies, such as 5G, operate at higher frequencies. However, this comes with a trade-off, and these higher frequencies travel substantially shorter distances. This means that you would need a much higher density of towers just to achieve the same network coverage. In the case of Malaysia, many remote areas were going to be left without network coverage in the middle of a monsoon season, which led to some towers being left online simply so people could contact emergency services. It&#8217;s worth noting that Malaysia also still operates its own 2G network as a fallback for the oldest of devices and maximum coverage.</p>\n<p>Given the challenges faced by a company as small and densely populated as Malaysia (104 people per square kilometre), it isn&#8217;t hard to visualise the issues for a country as big as Australia, which has a mere 3 people per square kilometre. Despite the fact that we already struggle with lacklustre coverage, even in populated areas, there is cause for alarm regarding the repercussions for more remote, rural communities. Will we suddenly find large groups of people struggle to contact emergency services simply due to the 3G switch off?</p>\n<h2 id=\"how-it-affects-you\">How It Affects You</h2>\n<p>You may be wondering what impact this will have on you, but determining what devices and equipment will be affected by this change is far from straightforward. Identifying phones is particularly tricky. There are countless models on the market, and each sports a different operating system, carrier, and country of origin. This makes it very hard to identify exactly what phone you have, let alone if it supports 4G or VoLTE. Even the information posted by carriers may only apply to phones sold by them. Beyond phones, knowing if your other equipment or devices will be supported can be very difficult. The easiest way is to find out directly from the manufacturer, although that can be very difficult if the company has disbanded or if they no longer acknowledge that product.</p>\n<p>In the event that your device does support the changes, it will still have reduced coverage in many areas, not even necessarily those that are remote. Certain urban houses and locations naturally lie in less than ideal locations and will see reductions in speed or the inability to connect. As for areas that are remote, they will become even further isolated and cut off from all that is around them.</p>\n<h2 id=\"may-2024-update\">May 2024 Update</h2>\n<p>Telstra announced today that they&#8217;ve delayed the discontinuation of their 3G services to August 31st. Previously, they had intentions of cutting off access on June 30th.</p>\n<p>They have also setup a way to check your device&#8217;s compatibility, with <a href=\"https://www.abc.net.au/news/2024-05-06/telstra-to-extend-3g-network-shutdown/103808110\">more information available on their website</a>.</p>\n<p>In my eyes, this still doesn&#8217;t excuse the unnecessary risk and inconvenience that this change introduces, but it is good to see that they are at least taking some action. Vodaphone has <a href=\"https://www.vodafone.com.au/support/network/3g-closure\">already closed their network</a>, but Optus customers <a href=\"https://www.optus.com.au/support/mobiles-tablets-wearables/important-changes-3g\">still have until September</a>.</p>\n<hr>\n<p>If you liked this article, then do consider sharing it, both for my own benefit and to raise awareness of the shutdown. Also, if you&#8217;d like to see me produce similar content into the future, then consider <a href=\"/support\">sending me a tip</a>. It&#8217;d mean a lot.</p>\n",
      "date_published": "2023-11-26",
      "id": "https://vale.rocks/posts/prematurely-pulling-the-plug-on-3g.html",
      "title": "Prematurely Pulling The Plug On 3G",
      "url": "https://vale.rocks/posts/prematurely-pulling-the-plug-on-3g.html"
    },
    {
      "content_html": "<p>The web used to embody its name—a spider&#8217;s web, a network of unique, interconnected sites woven together to construct a larger, open ecosystem. Unfortunately, we seem to have strayed from this vision. The focus has shifted from the freedom of independent sites to centralised, walled gardens, where profit takes precedence over user experience.</p>\n<p>Though a minority may still cherish the uniqueness of independent sites, their rarity makes standing out even more crucial to draw people away from the comfort of their algorithm-driven feeds. I think a site needs two things to attract attention: content worth reading and a design worth experiencing. This site is my attempt to offer both—a unique, accessible experience.</p>\n<p>Perhaps the greatest contributor to the philosophy behind my site is taken from the website of notable synth pioneer Wendy Carlos. Her site houses a page <a href=\"https://www.wendycarlos.com/live.html\">describing how her website &#8216;lives&#8217;</a>:</p>\n<blockquote>\n<p>I&#8217;m happy to report that this page (like most housework) will never be finished. It is a living document that grows and matures, just like most of real life. It is not a &#8220;work in progress&#8221;, for this would imply not much intrinsic value until that magic day it is completed.</p>\n<p>A novel is a work of art that, once completed may continue to exist forever in that finished state. An encyclopedia must be published at regular intervals to reflect new information gathered since the day it was published. Periodicals are timely only when first printed, then fall behind the times &#8211; get the latest issue to keep up. The technology behind web documents allows us to update information as often as is necessary. In this context, publishing dates become an outdated concept.</p>\n<p>While it is possible to &#8220;finish&#8221; a web document, the fixed information becomes stagnant, thus abolishing any desire for a return visit. This is something I call a cob-web page.</p>\n</blockquote>\n<p>Following that ethos, this site will continue to evolve as I tweak, edit, and break it as time goes on.</p>\n<h2 id=\"personas\">Personas</h2>\n<p>This site is crafted with three distinct user groups in mind:</p>\n<p>Firstly, visitors who arrive via a link to one of my articles, intent on reading. I expect this will be the majority of this site&#8217;s visitors, so it&#8217;s generally who I keep at the forefront of my mind, not just when I&#8217;m designing and implementing features but also when writing. It&#8217;s imperative that the site is quick to load for people coming from social media to ensure reader retention [^1]. This demographic is probably the most likely to read an article the full way through.</p>\n<p>Secondly, potential employers who would like to learn about me, view my portfolio, and get in contact. They likely won&#8217;t read the contents of an article, but it should look good at first glance.</p>\n<p>Finally, people who I interact with online that come to my site to find out more about me. These people are likely to have a quick prod around and check out the contents of the site, but don&#8217;t necessarily have a defined reason for their visit, and as such, likely won&#8217;t return without reason.</p>\n<h2 id=\"fundamentals\">Fundamentals</h2>\n<p>Every decision made for this site is weighted on both the personas above and these fundamentals:</p>\n<ol>\n<li><p><strong>Design like print:</strong>\nPrint design has a long and rich history, with centuries of systematic improvements, subtle enhancements, and steady refinements that have defined what works and constructed a solid foundation for how type should be set and presented. However, I feel like much of this gained knowledge has failed to migrate to the web.</p>\n<p>Well-established rules are often overlooked, and while readers may not consciously notice them, they matter and subtly shape the user experience. Where possible, I attempt to incorporate well-defined typographic principles.</p>\n<p>This isn&#8217;t always an easy thing to do. There are countless typography-related bugs and flaws in CSS and the larger web platform, as well as many expected features that simply haven&#8217;t yet seen support or consideration. There is also the matter of some typographic features, like smallcaps, being so uncommon on the web that users are confused in use.</p>\n</li>\n<li><p><strong>Function over form:</strong>\nWhile functionality should always dictate form, form shouldn&#8217;t necessarily dictate functionality. Notably, semantic elements and implementations are a priority, even if it comes at the cost of form. The web is for everyone, and I&#8217;m firmly of the belief that sites should respect that.</p>\n</li>\n<li><p><strong>JavaScript is optional:</strong>\nJavaScript has crept its tendrils into every facet of the web. This isn&#8217;t necessarily a bad thing; JavaScript has its place. However, that place <em>isn&#8217;t</em> everywhere, and users should be able to opt out and still experience the site, albeit in a potentially degraded state.</p>\n<p>While visiting this site with JavaScript enabled merits access to optional features, it <em>isn&#8217;t</em> required for the core reading experience, and everything will operate cleanly in its absence.</p>\n</li>\n</ol>\n<h2 id=\"features\">Features</h2>\n<p>Vale.Rocks is home to many non-standard features and some notable implementations of expected ones. These include:</p>\n<ul>\n<li><p><strong>Footnotes/Sidenotes:</strong>\nWithout JavaScript enabled, the footnotes (or perhaps more accurately, endnotes) are simply anchors to the definition at the end of the page. Assuming JavaScript is enabled, clicking a footnote opens a popover. If the viewport is sufficiently wide, then the footnotes also manifest as sidenotes in the page&#8217;s margin.</p>\n</li>\n<li><p><strong>Comments:</strong>\nGiven that this is a static site and my readership is generally of the variety that frequents GitHub, I&#8217;ve employed <a href=\"https://giscus.app\">Giscus</a> for comment functionality.</p>\n</li>\n<li><p><strong>Link icons:</strong>\nHyperlinks are the backbone of the web, and I employ some rudimentary CSS regex to prefix most links with icons to indicate if they link to an anchor within the page, a page within this site, or an external location.</p>\n</li>\n<li><p><strong>Figure lightboxes:</strong>\nWhile JavaScript is enabled, clicking on a figure opens it in a full-screen lightbox that allows users to view imagery in larger sizes alongside captions, attributions, and alt text.</p>\n</li>\n<li><p><strong>Scroll indicator:</strong>\nWhen perusing articles, a scroll progress bar appears at the top of the screen, with indicators of heading locations for ease of navigation. I&#8217;d like to improve this so that it plays nicer with additive content such as comments, is moved to a more advantageous position or larger viewports, and can be better used for swift navigation through articles by users.</p>\n</li>\n</ul>\n<p>If you&#8217;d like to see all of the site&#8217;s numerous features and stylings, you can do so on my <a href=\"/posts/lorem-ipsum\">Lorem Ipsum page</a>. It contains a complex assortment of most possible different formattings and layouts for testing and trialling interactions of elements in complex arrangements.</p>\n<h2 id=\"tooling\">Tooling</h2>\n<p>This site is built with my static site generator, <a href=\"https://adduce.vale.rocks\">Adduce</a>, and custom-written HTML, CSS, and JS. The source code is available in its entirety on <a href=\"https://github.com/DeclanChidlow/vale.rocks\">GitHub</a>. Previously, this site was built without the help of any generator, and later with <a href=\"https://jekyllrb.com\">Jeckyll</a>.</p>\n<p>The site itself uses very little in the way of external resources, with the exception of <a href=\"https://www.goatcounter.com\">GoatCounter</a> for simple, lightweight, and open source analytics.</p>\n<p>Everything is hosted on <a href=\"https://pages.github.com\">GitHub Pages</a>, thanks to their generous free plan, and Cloudflare runs in front of the hosting to permit caching and some more dynamic handling of requests.</p>\n<h2 id=\"inspirations\">Inspirations</h2>\n<p>Like all endeavours, and especially creative ones (which I would argue this site is), I&#8217;ve <em>borrowed</em> many ideas from external sources.</p>\n<p>Perhaps most notable is <a href=\"https://gwern.net\">the site of Gwern Branwen</a>, a slick blend of expertly written content and minimalist design. Despite stumbling upon Gwern&#8217;s site long after starting the development of this one, many of its eccentricities have made their way over, as you&#8217;ve no doubt noticed if you&#8217;ve ever paid Gwern&#8217;s site a visit.</p>\n<p>Another huge source of inspiration is <a href=\"https://www.lesswrong.com\">LessWrong</a>. A bit of a mix of blog and forum, LessWrong has some lovely typesetting, unique layouts, and many slick flourishes.</p>\n<p>In the same vein as the previous two, <a href=\"https://turntrout.com\">TurnTrout&#8217;s &#8216;The Pond&#8217;</a> incorporates many print-like typographic features and is very carefully crafted to create an experience that is a joy to read and interactive where it matters.</p>\n<p>In the very early stages of this site&#8217;s current iteration, the design was very much inspired by <a href=\"https://www.theverge.com\">The Verge</a>. Some vestiges of this include the right-aligned navigation menu and vertical text, although much of the influence has been diluted in the years since.</p>\n<p>Another source of inspiration for this site is <a href=\"https://www.joshwcomeau.com\">Josh W Comeau&#8217;s site</a>. Not really in terms of visual design, but in influence from his concept of small and unique features he dubs UI &#8216;sparkles&#8217;.</p>\n<hr>\n<h2 id=\"footnotes\">Footnotes</h2>\n<p>[^1]: <a href=\"https://www.thinkwithgoogle.com/intl/en-emea/marketing-strategies/app-and-mobile/mobile-page-speed-new-industry-benchmarks\">Google suggests</a> that 53% of visitors will bail on a site if it takes over three seconds to load. Pages should be fast, not only to prevent users from leaving but also to avoid inconveniencing users and to provide them a good experience.</p>\n",
      "date_published": "2022-09-12",
      "id": "https://vale.rocks/posts/the-design-of-this-site.html",
      "title": "The Design of This Site",
      "url": "https://vale.rocks/posts/the-design-of-this-site.html"
    },
    {
      "content_html": "<p>Document editing is a horrible business that I wouldn&#8217;t wish on my worst enemy. Fighting formats, muddled margins, puzzling paragraph breaks, annoying autocorrect, and stumbling spell checking leads to a mess of text that can&#8217;t be combated by even the most confident keyboard cowboys.</p>\n<p>I&#8217;ve spent a lot of time trying to wrangle my word editing and perfect my proofreading performance by configuring and tweaking my LibreOffice setup to perfection. First thing to look at is why I chose LibreOffice over any other document suite.</p>\n<h2 id=\"best-suite\">Best Suite</h2>\n<p>I feel it&#8217;d be wrong to write this article without at least mentioning the many document editing suites available and how I came to decide on LibreOffice. I&#8217;ve highlighted what I feel are reasonable choices that are under support. This means I&#8217;ve excluded suites such as KOffice, AbiWord, and OpenOffice.</p>\n<p><a href=\"https://www.office.com\">Microsoft Office</a> is obviously the biggest and arguably the best. It really needs no introduction; everyone uses Microsoft Office, and it has near endless features. It&#8217;s backed by a huge corporation and works pretty well. The caveat is that it&#8217;s locked behind an expensive subscription service and has telemetry built in. It&#8217;s also not available on Linux, which completely writes it off for me.</p>\n<p><a href=\"https://calligra.org\">Calligra</a> was another I looked at. It seemed rather nice, but is lacking many features that I would expect and was designed for KDE, a desktop environment I don&#8217;t use. I do quite like it for mobile document editing though and I recommend it for Android tablet users.</p>\n<p><a href=\"https://www.apple.com/iwork\">iWork</a> is Apple&#8217;s offering. I used it on my iPad 4, circa 2015. It&#8217;s alright. I don&#8217;t own a MacBook.</p>\n<p><a href=\"https://www.onlyoffice.com\">OnlyOffice</a> is a pretty fully featured option, but it gave me a lot of popups and is web based, rather than native, which affects integration with my computer. It does have very nice support for Microsoft Office&#8217;s formatting out of the box, though.</p>\n<p>The best office suite I&#8217;ve found has to be <a href=\"https://www.libreoffice.org\">LibreOffice</a>. It integrates well with my computer, is fast, and is pretty fully featured. It&#8217;s seen good support and shows little indication of slowing down. For that reason, it&#8217;s my number one choice.</p>\n<h2 id=\"installation\">Installation</h2>\n<p>LibreOffice comes in two main versions: still and fresh. Still, is a stable version that doesn&#8217;t get very frequent updates and lags behind in features, so I recommend Fresh. It has modern features and is much more stable than they give it credit for. On Arch Linux (my Linux distro of choice), it can be installed with <code>libreoffice-fresh</code>.</p>\n<h2 id=\"general-setup\">General Setup</h2>\n<p>The Arch Wiki has a wonderful guide, as always, on how to setup LibreOffice for general use. You can read it <a href=\"https://wiki.archlinux.org/title/LibreOffice\">here</a> and I very much recommend following it before the rest of my setup. It is Arch specific, but most can be translated for your distro. If you don&#8217;t use Linux, then you can skip this section and move directly onto the next step. A few things I&#8217;d like to point out for my ultimate setup is that I use GTK for theming, disable the startup logo, and install texmaths for LaTeX support as outlined in the guide. I don&#8217;t install the fonts as outlined in the Arch Wiki as I do it a different way for improved Microsoft Office compatibility.</p>\n<h2 id=\"theming\">Theming</h2>\n<p>Out of the box, LibreOffice isn&#8217;t perfect. It looks alright but some work is needed. If, like me, you chose to use GTK for theming, then you can use <a href=\"https://gradienceteam.github.io\">Gradience</a> to get it looking just how you want. That said, do read <a href=\"https://stopthemingmy.app\">this</a> before using it. If you don&#8217;t use GTK (or use something other then Linux) then you can ignore that and just change the icons. For this, you can navigate to <code>Tools &gt; Options</code> in the menubar of any of the applications. In the popup window, navigate to <code>LibreOffice &gt; View</code> and change the icon theme. I recommend the SVG version of Sukapura. You can choose the light or dark variant, depending on your theme.</p>\n<h2 id=\"improving-microsoft-office-compatibility\">Improving Microsoft Office Compatibility</h2>\n<p>If you&#8217;re coming from Microsoft Office or have to interact with Microsoft&#8217;s formats, then you may struggle with adapting your workflow or dealing with Office files. You should note that applications in LibreOffice have different names to those in MS Office. Word is Writer, PowerPoint is Impress, and Excel is Calc. To follow this next section of the guide, open up one of the applications within the suite, such as Writer.</p>\n<h3 id=\"changing-the-ribbon\">Changing the Ribbon</h3>\n<p>By default, the ribbon (that collection of icons at the top of the program) in LibreOffice is more reminiscent of MS Office 9x than MS Office 365. There is, fortunately, an easy fix. In the top menubar, click <code>View &gt; User Interface</code>. In the popup window that appears, select &#8216;Tabbed&#8217; and then &#8216;Apply to all&#8217;. This ensures that it will apply not just to the current program you&#8217;re using but to the entire suite.</p>\n<h3 id=\"installing-fonts\">Installing Fonts</h3>\n<p>Microsoft have a lot of their own fonts. You can skip this section if you use Windows, but you&#8217;ll likely want to acquire them if you use Linux, as they don&#8217;t come pre-packaged. Luckily for us, they can generally be installed with relative ease. If using Arch Linux, then there is a very useful Arch Wiki article on it <a href=\"https://wiki.archlinux.org/title/Microsoft_fonts\">here</a>. If you aren&#8217;t using Arch, then I wish you the best of luck.</p>\n<h3 id=\"removing-format-warnings\">Removing Format Warnings</h3>\n<p>LibreOffice often screams at you if you use MS Office file types. You can hide these warnings when saving files by navigating to the <code>Tools &gt; Options</code> (if you can&#8217;t find <code>Tools</code> then try pressing <code>alt</code>). In the popup, you can then navigate to <code>Load/Save &gt; General</code> and then untick &#8216;Warn when not saving in ODF or default format&#8217;.</p>\n<h3 id=\"improving-embeds\">Improving Embeds</h3>\n<p>Many embedded objects from MS Office don&#8217;t have perfect compatibility by default; to fix this, we can navigate to the <code>Tools &gt; Options &gt; Load/Save &gt; Microsoft Office</code> and ensure all the boxes in the Embedded Objects section are ticked.</p>\n<h3 id=\"reorganising-forms-and-adding-trailing-spaces\">Reorganising Forms and Adding Trailing Spaces</h3>\n<p>Navigate to <code>Tools &gt; Options &gt; LibreOffice Writer &gt; Compatibility</code> and ensure <code>Reorganise Form menu for Microsoft compatibility</code> and <code>Word-compatible trailing blanks</code> are ticked. Once done, click <code>Use as Default</code> and then <code>Yes</code> in the subsequent popup box.</p>\n<hr>\n<p>Are there any specific settings you change, or parts of this post that you think could be improved? Leave your suggestions in a comment.</p>\n",
      "date_published": "2023-06-16",
      "id": "https://vale.rocks/posts/the-ultimate-libreoffice-setup.html",
      "title": "The Ultimate LibreOffice Setup",
      "url": "https://vale.rocks/posts/the-ultimate-libreoffice-setup.html"
    }
  ]
}